{
  "name": "deviceManagement_virtualEndpoint_provisioningPolicies_cloudPcProvisioningPolicy_assign",
  "description": "Assign cloudPcProvisioningPolicy to user groups.",
  "parameters": {
    "type": "object",
    "properties": {
      "cloudPcProvisioningPolicy-id": {
        "type": "string",
        "description": "key: id of cloudPcProvisioningPolicy"
      },
      "body": {
        "properties": {
          "assignments": {
            "items": {
              "anyOf": [
                {
                  "$ref": "#/$defs/microsoft.graph.cloudPcProvisioningPolicyAssignment"
                },
                {
                  "nullable": true,
                  "type": "object"
                }
              ]
            },
            "type": "array"
          }
        },
        "type": "object",
        "description": "Action parameters"
      }
    },
    "required": [
      "cloudPcProvisioningPolicy-id",
      "body"
    ],
    "$defs": {
      "microsoft.graph.cloudPcProvisioningPolicyAssignment": {
        "allOf": [
          {
            "$ref": "#/$defs/microsoft.graph.entity"
          },
          {
            "properties": {
              "@odata.type": {
                "type": "string"
              },
              "target": {
                "anyOf": [
                  {
                    "$ref": "#/$defs/microsoft.graph.cloudPcManagementAssignmentTarget"
                  },
                  {
                    "nullable": true,
                    "type": "object"
                  }
                ],
                "description": "The assignment target for the provisioning policy. Currently, the only target supported for this policy is a user group. For details, see cloudPcManagementGroupAssignmentTarget."
              }
            },
            "required": [
              "@odata.type"
            ],
            "title": "cloudPcProvisioningPolicyAssignment",
            "type": "object"
          }
        ],
        "x-ms-discriminator-value": "#microsoft.graph.cloudPcProvisioningPolicyAssignment"
      },
      "microsoft.graph.entity": {
        "discriminator": {
          "mapping": {
            "#microsoft.graph.aadUserConversationMember": "#/components/schemas/microsoft.graph.aadUserConversationMember",
            "#microsoft.graph.accessPackage": "#/components/schemas/microsoft.graph.accessPackage",
            "#microsoft.graph.accessPackageAssignment": "#/components/schemas/microsoft.graph.accessPackageAssignment",
            "#microsoft.graph.accessPackageAssignmentPolicy": "#/components/schemas/microsoft.graph.accessPackageAssignmentPolicy",
            "#microsoft.graph.accessPackageAssignmentRequest": "#/components/schemas/microsoft.graph.accessPackageAssignmentRequest",
            "#microsoft.graph.accessPackageAssignmentResourceRole": "#/components/schemas/microsoft.graph.accessPackageAssignmentResourceRole",
            "#microsoft.graph.accessPackageCatalog": "#/components/schemas/microsoft.graph.accessPackageCatalog",
            "#microsoft.graph.accessPackageResource": "#/components/schemas/microsoft.graph.accessPackageResource",
            "#microsoft.graph.accessPackageResourceEnvironment": "#/components/schemas/microsoft.graph.accessPackageResourceEnvironment",
            "#microsoft.graph.accessPackageResourceRequest": "#/components/schemas/microsoft.graph.accessPackageResourceRequest",
            "#microsoft.graph.accessPackageResourceRole": "#/components/schemas/microsoft.graph.accessPackageResourceRole",
            "#microsoft.graph.accessPackageResourceRoleScope": "#/components/schemas/microsoft.graph.accessPackageResourceRoleScope",
            "#microsoft.graph.accessPackageResourceScope": "#/components/schemas/microsoft.graph.accessPackageResourceScope",
            "#microsoft.graph.accessPackageSubject": "#/components/schemas/microsoft.graph.accessPackageSubject",
            "#microsoft.graph.accessReview": "#/components/schemas/microsoft.graph.accessReview",
            "#microsoft.graph.accessReviewDecision": "#/components/schemas/microsoft.graph.accessReviewDecision",
            "#microsoft.graph.accessReviewHistoryDefinition": "#/components/schemas/microsoft.graph.accessReviewHistoryDefinition",
            "#microsoft.graph.accessReviewHistoryInstance": "#/components/schemas/microsoft.graph.accessReviewHistoryInstance",
            "#microsoft.graph.accessReviewInstance": "#/components/schemas/microsoft.graph.accessReviewInstance",
            "#microsoft.graph.accessReviewInstanceDecisionItem": "#/components/schemas/microsoft.graph.accessReviewInstanceDecisionItem",
            "#microsoft.graph.accessReviewPolicy": "#/components/schemas/microsoft.graph.accessReviewPolicy",
            "#microsoft.graph.accessReviewReviewer": "#/components/schemas/microsoft.graph.accessReviewReviewer",
            "#microsoft.graph.accessReviewScheduleDefinition": "#/components/schemas/microsoft.graph.accessReviewScheduleDefinition",
            "#microsoft.graph.accessReviewSet": "#/components/schemas/microsoft.graph.accessReviewSet",
            "#microsoft.graph.accessReviewStage": "#/components/schemas/microsoft.graph.accessReviewStage",
            "#microsoft.graph.account": "#/components/schemas/microsoft.graph.account",
            "#microsoft.graph.activeDirectoryWindowsAutopilotDeploymentProfile": "#/components/schemas/microsoft.graph.activeDirectoryWindowsAutopilotDeploymentProfile",
            "#microsoft.graph.activityBasedTimeoutPolicy": "#/components/schemas/microsoft.graph.activityBasedTimeoutPolicy",
            "#microsoft.graph.activityHistoryItem": "#/components/schemas/microsoft.graph.activityHistoryItem",
            "#microsoft.graph.activityStatistics": "#/components/schemas/microsoft.graph.activityStatistics",
            "#microsoft.graph.addLargeGalleryViewOperation": "#/components/schemas/microsoft.graph.addLargeGalleryViewOperation",
            "#microsoft.graph.adminConsentRequestPolicy": "#/components/schemas/microsoft.graph.adminConsentRequestPolicy",
            "#microsoft.graph.adminReportSettings": "#/components/schemas/microsoft.graph.adminReportSettings",
            "#microsoft.graph.adminWindows": "#/components/schemas/microsoft.graph.adminWindows",
            "#microsoft.graph.adminWindowsUpdates": "#/components/schemas/microsoft.graph.adminWindowsUpdates",
            "#microsoft.graph.administrativeUnit": "#/components/schemas/microsoft.graph.administrativeUnit",
            "#microsoft.graph.advancedThreatProtectionOnboardingDeviceSettingState": "#/components/schemas/microsoft.graph.advancedThreatProtectionOnboardingDeviceSettingState",
            "#microsoft.graph.advancedThreatProtectionOnboardingStateSummary": "#/components/schemas/microsoft.graph.advancedThreatProtectionOnboardingStateSummary",
            "#microsoft.graph.agedAccountsPayable": "#/components/schemas/microsoft.graph.agedAccountsPayable",
            "#microsoft.graph.agedAccountsReceivable": "#/components/schemas/microsoft.graph.agedAccountsReceivable",
            "#microsoft.graph.agreement": "#/components/schemas/microsoft.graph.agreement",
            "#microsoft.graph.agreementAcceptance": "#/components/schemas/microsoft.graph.agreementAcceptance",
            "#microsoft.graph.agreementFile": "#/components/schemas/microsoft.graph.agreementFile",
            "#microsoft.graph.agreementFileLocalization": "#/components/schemas/microsoft.graph.agreementFileLocalization",
            "#microsoft.graph.agreementFileProperties": "#/components/schemas/microsoft.graph.agreementFileProperties",
            "#microsoft.graph.agreementFileVersion": "#/components/schemas/microsoft.graph.agreementFileVersion",
            "#microsoft.graph.alert": "#/components/schemas/microsoft.graph.alert",
            "#microsoft.graph.allowedDataLocation": "#/components/schemas/microsoft.graph.allowedDataLocation",
            "#microsoft.graph.allowedValue": "#/components/schemas/microsoft.graph.allowedValue",
            "#microsoft.graph.androidCertificateProfileBase": "#/components/schemas/microsoft.graph.androidCertificateProfileBase",
            "#microsoft.graph.androidCompliancePolicy": "#/components/schemas/microsoft.graph.androidCompliancePolicy",
            "#microsoft.graph.androidCustomConfiguration": "#/components/schemas/microsoft.graph.androidCustomConfiguration",
            "#microsoft.graph.androidDeviceComplianceLocalActionBase": "#/components/schemas/microsoft.graph.androidDeviceComplianceLocalActionBase",
            "#microsoft.graph.androidDeviceComplianceLocalActionLockDevice": "#/components/schemas/microsoft.graph.androidDeviceComplianceLocalActionLockDevice",
            "#microsoft.graph.androidDeviceComplianceLocalActionLockDeviceWithPasscode": "#/components/schemas/microsoft.graph.androidDeviceComplianceLocalActionLockDeviceWithPasscode",
            "#microsoft.graph.androidDeviceOwnerCertificateProfileBase": "#/components/schemas/microsoft.graph.androidDeviceOwnerCertificateProfileBase",
            "#microsoft.graph.androidDeviceOwnerCompliancePolicy": "#/components/schemas/microsoft.graph.androidDeviceOwnerCompliancePolicy",
            "#microsoft.graph.androidDeviceOwnerDerivedCredentialAuthenticationConfiguration": "#/components/schemas/microsoft.graph.androidDeviceOwnerDerivedCredentialAuthenticationConfiguration",
            "#microsoft.graph.androidDeviceOwnerEnrollmentProfile": "#/components/schemas/microsoft.graph.androidDeviceOwnerEnrollmentProfile",
            "#microsoft.graph.androidDeviceOwnerEnterpriseWiFiConfiguration": "#/components/schemas/microsoft.graph.androidDeviceOwnerEnterpriseWiFiConfiguration",
            "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration": "#/components/schemas/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
            "#microsoft.graph.androidDeviceOwnerImportedPFXCertificateProfile": "#/components/schemas/microsoft.graph.androidDeviceOwnerImportedPFXCertificateProfile",
            "#microsoft.graph.androidDeviceOwnerPkcsCertificateProfile": "#/components/schemas/microsoft.graph.androidDeviceOwnerPkcsCertificateProfile",
            "#microsoft.graph.androidDeviceOwnerScepCertificateProfile": "#/components/schemas/microsoft.graph.androidDeviceOwnerScepCertificateProfile",
            "#microsoft.graph.androidDeviceOwnerTrustedRootCertificate": "#/components/schemas/microsoft.graph.androidDeviceOwnerTrustedRootCertificate",
            "#microsoft.graph.androidDeviceOwnerVpnConfiguration": "#/components/schemas/microsoft.graph.androidDeviceOwnerVpnConfiguration",
            "#microsoft.graph.androidDeviceOwnerWiFiConfiguration": "#/components/schemas/microsoft.graph.androidDeviceOwnerWiFiConfiguration",
            "#microsoft.graph.androidEasEmailProfileConfiguration": "#/components/schemas/microsoft.graph.androidEasEmailProfileConfiguration",
            "#microsoft.graph.androidEnterpriseWiFiConfiguration": "#/components/schemas/microsoft.graph.androidEnterpriseWiFiConfiguration",
            "#microsoft.graph.androidForWorkApp": "#/components/schemas/microsoft.graph.androidForWorkApp",
            "#microsoft.graph.androidForWorkAppConfigurationSchema": "#/components/schemas/microsoft.graph.androidForWorkAppConfigurationSchema",
            "#microsoft.graph.androidForWorkCertificateProfileBase": "#/components/schemas/microsoft.graph.androidForWorkCertificateProfileBase",
            "#microsoft.graph.androidForWorkCompliancePolicy": "#/components/schemas/microsoft.graph.androidForWorkCompliancePolicy",
            "#microsoft.graph.androidForWorkCustomConfiguration": "#/components/schemas/microsoft.graph.androidForWorkCustomConfiguration",
            "#microsoft.graph.androidForWorkEasEmailProfileBase": "#/components/schemas/microsoft.graph.androidForWorkEasEmailProfileBase",
            "#microsoft.graph.androidForWorkEnrollmentProfile": "#/components/schemas/microsoft.graph.androidForWorkEnrollmentProfile",
            "#microsoft.graph.androidForWorkEnterpriseWiFiConfiguration": "#/components/schemas/microsoft.graph.androidForWorkEnterpriseWiFiConfiguration",
            "#microsoft.graph.androidForWorkGeneralDeviceConfiguration": "#/components/schemas/microsoft.graph.androidForWorkGeneralDeviceConfiguration",
            "#microsoft.graph.androidForWorkGmailEasConfiguration": "#/components/schemas/microsoft.graph.androidForWorkGmailEasConfiguration",
            "#microsoft.graph.androidForWorkImportedPFXCertificateProfile": "#/components/schemas/microsoft.graph.androidForWorkImportedPFXCertificateProfile",
            "#microsoft.graph.androidForWorkMobileAppConfiguration": "#/components/schemas/microsoft.graph.androidForWorkMobileAppConfiguration",
            "#microsoft.graph.androidForWorkNineWorkEasConfiguration": "#/components/schemas/microsoft.graph.androidForWorkNineWorkEasConfiguration",
            "#microsoft.graph.androidForWorkPkcsCertificateProfile": "#/components/schemas/microsoft.graph.androidForWorkPkcsCertificateProfile",
            "#microsoft.graph.androidForWorkScepCertificateProfile": "#/components/schemas/microsoft.graph.androidForWorkScepCertificateProfile",
            "#microsoft.graph.androidForWorkSettings": "#/components/schemas/microsoft.graph.androidForWorkSettings",
            "#microsoft.graph.androidForWorkTrustedRootCertificate": "#/components/schemas/microsoft.graph.androidForWorkTrustedRootCertificate",
            "#microsoft.graph.androidForWorkVpnConfiguration": "#/components/schemas/microsoft.graph.androidForWorkVpnConfiguration",
            "#microsoft.graph.androidForWorkWiFiConfiguration": "#/components/schemas/microsoft.graph.androidForWorkWiFiConfiguration",
            "#microsoft.graph.androidGeneralDeviceConfiguration": "#/components/schemas/microsoft.graph.androidGeneralDeviceConfiguration",
            "#microsoft.graph.androidImportedPFXCertificateProfile": "#/components/schemas/microsoft.graph.androidImportedPFXCertificateProfile",
            "#microsoft.graph.androidLobApp": "#/components/schemas/microsoft.graph.androidLobApp",
            "#microsoft.graph.androidManagedAppProtection": "#/components/schemas/microsoft.graph.androidManagedAppProtection",
            "#microsoft.graph.androidManagedAppRegistration": "#/components/schemas/microsoft.graph.androidManagedAppRegistration",
            "#microsoft.graph.androidManagedStoreAccountEnterpriseSettings": "#/components/schemas/microsoft.graph.androidManagedStoreAccountEnterpriseSettings",
            "#microsoft.graph.androidManagedStoreApp": "#/components/schemas/microsoft.graph.androidManagedStoreApp",
            "#microsoft.graph.androidManagedStoreAppConfiguration": "#/components/schemas/microsoft.graph.androidManagedStoreAppConfiguration",
            "#microsoft.graph.androidManagedStoreAppConfigurationSchema": "#/components/schemas/microsoft.graph.androidManagedStoreAppConfigurationSchema",
            "#microsoft.graph.androidManagedStoreWebApp": "#/components/schemas/microsoft.graph.androidManagedStoreWebApp",
            "#microsoft.graph.androidOmaCpConfiguration": "#/components/schemas/microsoft.graph.androidOmaCpConfiguration",
            "#microsoft.graph.androidPkcsCertificateProfile": "#/components/schemas/microsoft.graph.androidPkcsCertificateProfile",
            "#microsoft.graph.androidScepCertificateProfile": "#/components/schemas/microsoft.graph.androidScepCertificateProfile",
            "#microsoft.graph.androidStoreApp": "#/components/schemas/microsoft.graph.androidStoreApp",
            "#microsoft.graph.androidTrustedRootCertificate": "#/components/schemas/microsoft.graph.androidTrustedRootCertificate",
            "#microsoft.graph.androidVpnConfiguration": "#/components/schemas/microsoft.graph.androidVpnConfiguration",
            "#microsoft.graph.androidWiFiConfiguration": "#/components/schemas/microsoft.graph.androidWiFiConfiguration",
            "#microsoft.graph.androidWorkProfileCertificateProfileBase": "#/components/schemas/microsoft.graph.androidWorkProfileCertificateProfileBase",
            "#microsoft.graph.androidWorkProfileCompliancePolicy": "#/components/schemas/microsoft.graph.androidWorkProfileCompliancePolicy",
            "#microsoft.graph.androidWorkProfileCustomConfiguration": "#/components/schemas/microsoft.graph.androidWorkProfileCustomConfiguration",
            "#microsoft.graph.androidWorkProfileEasEmailProfileBase": "#/components/schemas/microsoft.graph.androidWorkProfileEasEmailProfileBase",
            "#microsoft.graph.androidWorkProfileEnterpriseWiFiConfiguration": "#/components/schemas/microsoft.graph.androidWorkProfileEnterpriseWiFiConfiguration",
            "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration": "#/components/schemas/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
            "#microsoft.graph.androidWorkProfileGmailEasConfiguration": "#/components/schemas/microsoft.graph.androidWorkProfileGmailEasConfiguration",
            "#microsoft.graph.androidWorkProfileNineWorkEasConfiguration": "#/components/schemas/microsoft.graph.androidWorkProfileNineWorkEasConfiguration",
            "#microsoft.graph.androidWorkProfilePkcsCertificateProfile": "#/components/schemas/microsoft.graph.androidWorkProfilePkcsCertificateProfile",
            "#microsoft.graph.androidWorkProfileScepCertificateProfile": "#/components/schemas/microsoft.graph.androidWorkProfileScepCertificateProfile",
            "#microsoft.graph.androidWorkProfileTrustedRootCertificate": "#/components/schemas/microsoft.graph.androidWorkProfileTrustedRootCertificate",
            "#microsoft.graph.androidWorkProfileVpnConfiguration": "#/components/schemas/microsoft.graph.androidWorkProfileVpnConfiguration",
            "#microsoft.graph.androidWorkProfileWiFiConfiguration": "#/components/schemas/microsoft.graph.androidWorkProfileWiFiConfiguration",
            "#microsoft.graph.anonymousGuestConversationMember": "#/components/schemas/microsoft.graph.anonymousGuestConversationMember",
            "#microsoft.graph.aospDeviceOwnerCertificateProfileBase": "#/components/schemas/microsoft.graph.aospDeviceOwnerCertificateProfileBase",
            "#microsoft.graph.aospDeviceOwnerCompliancePolicy": "#/components/schemas/microsoft.graph.aospDeviceOwnerCompliancePolicy",
            "#microsoft.graph.aospDeviceOwnerDeviceConfiguration": "#/components/schemas/microsoft.graph.aospDeviceOwnerDeviceConfiguration",
            "#microsoft.graph.aospDeviceOwnerEnterpriseWiFiConfiguration": "#/components/schemas/microsoft.graph.aospDeviceOwnerEnterpriseWiFiConfiguration",
            "#microsoft.graph.aospDeviceOwnerPkcsCertificateProfile": "#/components/schemas/microsoft.graph.aospDeviceOwnerPkcsCertificateProfile",
            "#microsoft.graph.aospDeviceOwnerScepCertificateProfile": "#/components/schemas/microsoft.graph.aospDeviceOwnerScepCertificateProfile",
            "#microsoft.graph.aospDeviceOwnerTrustedRootCertificate": "#/components/schemas/microsoft.graph.aospDeviceOwnerTrustedRootCertificate",
            "#microsoft.graph.aospDeviceOwnerWiFiConfiguration": "#/components/schemas/microsoft.graph.aospDeviceOwnerWiFiConfiguration",
            "#microsoft.graph.appConsentApprovalRoute": "#/components/schemas/microsoft.graph.appConsentApprovalRoute",
            "#microsoft.graph.appConsentRequest": "#/components/schemas/microsoft.graph.appConsentRequest",
            "#microsoft.graph.appLogCollectionRequest": "#/components/schemas/microsoft.graph.appLogCollectionRequest",
            "#microsoft.graph.appManagementPolicy": "#/components/schemas/microsoft.graph.appManagementPolicy",
            "#microsoft.graph.appRoleAssignment": "#/components/schemas/microsoft.graph.appRoleAssignment",
            "#microsoft.graph.appScope": "#/components/schemas/microsoft.graph.appScope",
            "#microsoft.graph.appVulnerabilityManagedDevice": "#/components/schemas/microsoft.graph.appVulnerabilityManagedDevice",
            "#microsoft.graph.appVulnerabilityMobileApp": "#/components/schemas/microsoft.graph.appVulnerabilityMobileApp",
            "#microsoft.graph.appVulnerabilityTask": "#/components/schemas/microsoft.graph.appVulnerabilityTask",
            "#microsoft.graph.appleDeviceFeaturesConfigurationBase": "#/components/schemas/microsoft.graph.appleDeviceFeaturesConfigurationBase",
            "#microsoft.graph.appleEnrollmentProfileAssignment": "#/components/schemas/microsoft.graph.appleEnrollmentProfileAssignment",
            "#microsoft.graph.appleExpeditedCheckinConfigurationBase": "#/components/schemas/microsoft.graph.appleExpeditedCheckinConfigurationBase",
            "#microsoft.graph.appleManagedIdentityProvider": "#/components/schemas/microsoft.graph.appleManagedIdentityProvider",
            "#microsoft.graph.applePushNotificationCertificate": "#/components/schemas/microsoft.graph.applePushNotificationCertificate",
            "#microsoft.graph.appleUserInitiatedEnrollmentProfile": "#/components/schemas/microsoft.graph.appleUserInitiatedEnrollmentProfile",
            "#microsoft.graph.appleVpnConfiguration": "#/components/schemas/microsoft.graph.appleVpnConfiguration",
            "#microsoft.graph.appleVppTokenTroubleshootingEvent": "#/components/schemas/microsoft.graph.appleVppTokenTroubleshootingEvent",
            "#microsoft.graph.application": "#/components/schemas/microsoft.graph.application",
            "#microsoft.graph.applicationSegment": "#/components/schemas/microsoft.graph.applicationSegment",
            "#microsoft.graph.applicationSignInDetailedSummary": "#/components/schemas/microsoft.graph.applicationSignInDetailedSummary",
            "#microsoft.graph.applicationSignInSummary": "#/components/schemas/microsoft.graph.applicationSignInSummary",
            "#microsoft.graph.applicationTemplate": "#/components/schemas/microsoft.graph.applicationTemplate",
            "#microsoft.graph.approval": "#/components/schemas/microsoft.graph.approval",
            "#microsoft.graph.approvalStep": "#/components/schemas/microsoft.graph.approvalStep",
            "#microsoft.graph.approvalWorkflowProvider": "#/components/schemas/microsoft.graph.approvalWorkflowProvider",
            "#microsoft.graph.assignmentFilterEvaluationStatusDetails": "#/components/schemas/microsoft.graph.assignmentFilterEvaluationStatusDetails",
            "#microsoft.graph.associatedTeamInfo": "#/components/schemas/microsoft.graph.associatedTeamInfo",
            "#microsoft.graph.attachment": "#/components/schemas/microsoft.graph.attachment",
            "#microsoft.graph.attachmentBase": "#/components/schemas/microsoft.graph.attachmentBase",
            "#microsoft.graph.attachmentSession": "#/components/schemas/microsoft.graph.attachmentSession",
            "#microsoft.graph.attackSimulationOperation": "#/components/schemas/microsoft.graph.attackSimulationOperation",
            "#microsoft.graph.attackSimulationRoot": "#/components/schemas/microsoft.graph.attackSimulationRoot",
            "#microsoft.graph.attendanceRecord": "#/components/schemas/microsoft.graph.attendanceRecord",
            "#microsoft.graph.attributeMappingFunctionSchema": "#/components/schemas/microsoft.graph.attributeMappingFunctionSchema",
            "#microsoft.graph.attributeSet": "#/components/schemas/microsoft.graph.attributeSet",
            "#microsoft.graph.audioRoutingGroup": "#/components/schemas/microsoft.graph.audioRoutingGroup",
            "#microsoft.graph.auditEvent": "#/components/schemas/microsoft.graph.auditEvent",
            "#microsoft.graph.authentication": "#/components/schemas/microsoft.graph.authentication",
            "#microsoft.graph.authenticationCombinationConfiguration": "#/components/schemas/microsoft.graph.authenticationCombinationConfiguration",
            "#microsoft.graph.authenticationContextClassReference": "#/components/schemas/microsoft.graph.authenticationContextClassReference",
            "#microsoft.graph.authenticationEventListener": "#/components/schemas/microsoft.graph.authenticationEventListener",
            "#microsoft.graph.authenticationEventsPolicy": "#/components/schemas/microsoft.graph.authenticationEventsPolicy",
            "#microsoft.graph.authenticationFlowsPolicy": "#/components/schemas/microsoft.graph.authenticationFlowsPolicy",
            "#microsoft.graph.authenticationListener": "#/components/schemas/microsoft.graph.authenticationListener",
            "#microsoft.graph.authenticationMethod": "#/components/schemas/microsoft.graph.authenticationMethod",
            "#microsoft.graph.authenticationMethodConfiguration": "#/components/schemas/microsoft.graph.authenticationMethodConfiguration",
            "#microsoft.graph.authenticationMethodModeDetail": "#/components/schemas/microsoft.graph.authenticationMethodModeDetail",
            "#microsoft.graph.authenticationMethodTarget": "#/components/schemas/microsoft.graph.authenticationMethodTarget",
            "#microsoft.graph.authenticationMethodsPolicy": "#/components/schemas/microsoft.graph.authenticationMethodsPolicy",
            "#microsoft.graph.authenticationMethodsRoot": "#/components/schemas/microsoft.graph.authenticationMethodsRoot",
            "#microsoft.graph.authenticationStrengthPolicy": "#/components/schemas/microsoft.graph.authenticationStrengthPolicy",
            "#microsoft.graph.authenticationStrengthRoot": "#/components/schemas/microsoft.graph.authenticationStrengthRoot",
            "#microsoft.graph.authoredNote": "#/components/schemas/microsoft.graph.authoredNote",
            "#microsoft.graph.authorizationPolicy": "#/components/schemas/microsoft.graph.authorizationPolicy",
            "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile": "#/components/schemas/microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
            "#microsoft.graph.azureCommunicationServicesUserConversationMember": "#/components/schemas/microsoft.graph.azureCommunicationServicesUserConversationMember",
            "#microsoft.graph.b2cAuthenticationMethodsPolicy": "#/components/schemas/microsoft.graph.b2cAuthenticationMethodsPolicy",
            "#microsoft.graph.b2cIdentityUserFlow": "#/components/schemas/microsoft.graph.b2cIdentityUserFlow",
            "#microsoft.graph.b2xIdentityUserFlow": "#/components/schemas/microsoft.graph.b2xIdentityUserFlow",
            "#microsoft.graph.baseItem": "#/components/schemas/microsoft.graph.baseItem",
            "#microsoft.graph.baseItemVersion": "#/components/schemas/microsoft.graph.baseItemVersion",
            "#microsoft.graph.bitlocker": "#/components/schemas/microsoft.graph.bitlocker",
            "#microsoft.graph.bitlockerRecoveryKey": "#/components/schemas/microsoft.graph.bitlockerRecoveryKey",
            "#microsoft.graph.bookingAppointment": "#/components/schemas/microsoft.graph.bookingAppointment",
            "#microsoft.graph.bookingBusiness": "#/components/schemas/microsoft.graph.bookingBusiness",
            "#microsoft.graph.bookingCurrency": "#/components/schemas/microsoft.graph.bookingCurrency",
            "#microsoft.graph.bookingCustomQuestion": "#/components/schemas/microsoft.graph.bookingCustomQuestion",
            "#microsoft.graph.bookingCustomer": "#/components/schemas/microsoft.graph.bookingCustomer",
            "#microsoft.graph.bookingNamedEntity": "#/components/schemas/microsoft.graph.bookingNamedEntity",
            "#microsoft.graph.bookingPerson": "#/components/schemas/microsoft.graph.bookingPerson",
            "#microsoft.graph.bookingService": "#/components/schemas/microsoft.graph.bookingService",
            "#microsoft.graph.bookingStaffMember": "#/components/schemas/microsoft.graph.bookingStaffMember",
            "#microsoft.graph.browserSharedCookie": "#/components/schemas/microsoft.graph.browserSharedCookie",
            "#microsoft.graph.browserSite": "#/components/schemas/microsoft.graph.browserSite",
            "#microsoft.graph.browserSiteList": "#/components/schemas/microsoft.graph.browserSiteList",
            "#microsoft.graph.builtInIdentityProvider": "#/components/schemas/microsoft.graph.builtInIdentityProvider",
            "#microsoft.graph.businessFlow": "#/components/schemas/microsoft.graph.businessFlow",
            "#microsoft.graph.businessFlowTemplate": "#/components/schemas/microsoft.graph.businessFlowTemplate",
            "#microsoft.graph.businessScenario": "#/components/schemas/microsoft.graph.businessScenario",
            "#microsoft.graph.businessScenarioPlanReference": "#/components/schemas/microsoft.graph.businessScenarioPlanReference",
            "#microsoft.graph.businessScenarioPlanner": "#/components/schemas/microsoft.graph.businessScenarioPlanner",
            "#microsoft.graph.businessScenarioTask": "#/components/schemas/microsoft.graph.businessScenarioTask",
            "#microsoft.graph.calendar": "#/components/schemas/microsoft.graph.calendar",
            "#microsoft.graph.calendarGroup": "#/components/schemas/microsoft.graph.calendarGroup",
            "#microsoft.graph.calendarPermission": "#/components/schemas/microsoft.graph.calendarPermission",
            "#microsoft.graph.calendarSharingMessage": "#/components/schemas/microsoft.graph.calendarSharingMessage",
            "#microsoft.graph.call": "#/components/schemas/microsoft.graph.call",
            "#microsoft.graph.callActivityStatistics": "#/components/schemas/microsoft.graph.callActivityStatistics",
            "#microsoft.graph.callRecords.callRecord": "#/components/schemas/microsoft.graph.callRecords.callRecord",
            "#microsoft.graph.callRecords.segment": "#/components/schemas/microsoft.graph.callRecords.segment",
            "#microsoft.graph.callRecords.session": "#/components/schemas/microsoft.graph.callRecords.session",
            "#microsoft.graph.callTranscript": "#/components/schemas/microsoft.graph.callTranscript",
            "#microsoft.graph.cancelMediaProcessingOperation": "#/components/schemas/microsoft.graph.cancelMediaProcessingOperation",
            "#microsoft.graph.canvasLayout": "#/components/schemas/microsoft.graph.canvasLayout",
            "#microsoft.graph.cartToClassAssociation": "#/components/schemas/microsoft.graph.cartToClassAssociation",
            "#microsoft.graph.certificateBasedAuthConfiguration": "#/components/schemas/microsoft.graph.certificateBasedAuthConfiguration",
            "#microsoft.graph.certificateConnectorDetails": "#/components/schemas/microsoft.graph.certificateConnectorDetails",
            "#microsoft.graph.changeTrackedEntity": "#/components/schemas/microsoft.graph.changeTrackedEntity",
            "#microsoft.graph.channel": "#/components/schemas/microsoft.graph.channel",
            "#microsoft.graph.chat": "#/components/schemas/microsoft.graph.chat",
            "#microsoft.graph.chatActivityStatistics": "#/components/schemas/microsoft.graph.chatActivityStatistics",
            "#microsoft.graph.chatMessage": "#/components/schemas/microsoft.graph.chatMessage",
            "#microsoft.graph.chatMessageHostedContent": "#/components/schemas/microsoft.graph.chatMessageHostedContent",
            "#microsoft.graph.chatMessageInfo": "#/components/schemas/microsoft.graph.chatMessageInfo",
            "#microsoft.graph.checklistItem": "#/components/schemas/microsoft.graph.checklistItem",
            "#microsoft.graph.chromeOSOnboardingSettings": "#/components/schemas/microsoft.graph.chromeOSOnboardingSettings",
            "#microsoft.graph.claimsMappingPolicy": "#/components/schemas/microsoft.graph.claimsMappingPolicy",
            "#microsoft.graph.classificationJobResponse": "#/components/schemas/microsoft.graph.classificationJobResponse",
            "#microsoft.graph.cloudAppSecurityProfile": "#/components/schemas/microsoft.graph.cloudAppSecurityProfile",
            "#microsoft.graph.cloudCommunications": "#/components/schemas/microsoft.graph.cloudCommunications",
            "#microsoft.graph.cloudPC": "#/components/schemas/microsoft.graph.cloudPC",
            "#microsoft.graph.cloudPCConnectivityIssue": "#/components/schemas/microsoft.graph.cloudPCConnectivityIssue",
            "#microsoft.graph.cloudPcAuditEvent": "#/components/schemas/microsoft.graph.cloudPcAuditEvent",
            "#microsoft.graph.cloudPcCrossCloudGovernmentOrganizationMapping": "#/components/schemas/microsoft.graph.cloudPcCrossCloudGovernmentOrganizationMapping",
            "#microsoft.graph.cloudPcDeviceImage": "#/components/schemas/microsoft.graph.cloudPcDeviceImage",
            "#microsoft.graph.cloudPcExportJob": "#/components/schemas/microsoft.graph.cloudPcExportJob",
            "#microsoft.graph.cloudPcExternalPartnerSetting": "#/components/schemas/microsoft.graph.cloudPcExternalPartnerSetting",
            "#microsoft.graph.cloudPcGalleryImage": "#/components/schemas/microsoft.graph.cloudPcGalleryImage",
            "#microsoft.graph.cloudPcOnPremisesConnection": "#/components/schemas/microsoft.graph.cloudPcOnPremisesConnection",
            "#microsoft.graph.cloudPcOrganizationSettings": "#/components/schemas/microsoft.graph.cloudPcOrganizationSettings",
            "#microsoft.graph.cloudPcProvisioningPolicy": "#/components/schemas/microsoft.graph.cloudPcProvisioningPolicy",
            "#microsoft.graph.cloudPcProvisioningPolicyAssignment": "#/components/schemas/microsoft.graph.cloudPcProvisioningPolicyAssignment",
            "#microsoft.graph.cloudPcReports": "#/components/schemas/microsoft.graph.cloudPcReports",
            "#microsoft.graph.cloudPcServicePlan": "#/components/schemas/microsoft.graph.cloudPcServicePlan",
            "#microsoft.graph.cloudPcSharedUseServicePlan": "#/components/schemas/microsoft.graph.cloudPcSharedUseServicePlan",
            "#microsoft.graph.cloudPcSnapshot": "#/components/schemas/microsoft.graph.cloudPcSnapshot",
            "#microsoft.graph.cloudPcSupportedRegion": "#/components/schemas/microsoft.graph.cloudPcSupportedRegion",
            "#microsoft.graph.cloudPcUserSetting": "#/components/schemas/microsoft.graph.cloudPcUserSetting",
            "#microsoft.graph.cloudPcUserSettingAssignment": "#/components/schemas/microsoft.graph.cloudPcUserSettingAssignment",
            "#microsoft.graph.columnDefinition": "#/components/schemas/microsoft.graph.columnDefinition",
            "#microsoft.graph.columnLink": "#/components/schemas/microsoft.graph.columnLink",
            "#microsoft.graph.comanagementEligibleDevice": "#/components/schemas/microsoft.graph.comanagementEligibleDevice",
            "#microsoft.graph.command": "#/components/schemas/microsoft.graph.command",
            "#microsoft.graph.commsOperation": "#/components/schemas/microsoft.graph.commsOperation",
            "#microsoft.graph.company": "#/components/schemas/microsoft.graph.company",
            "#microsoft.graph.companyInformation": "#/components/schemas/microsoft.graph.companyInformation",
            "#microsoft.graph.complianceManagementPartner": "#/components/schemas/microsoft.graph.complianceManagementPartner",
            "#microsoft.graph.conditionalAccessPolicy": "#/components/schemas/microsoft.graph.conditionalAccessPolicy",
            "#microsoft.graph.conditionalAccessRoot": "#/components/schemas/microsoft.graph.conditionalAccessRoot",
            "#microsoft.graph.conditionalAccessTemplate": "#/components/schemas/microsoft.graph.conditionalAccessTemplate",
            "#microsoft.graph.configManagerCollection": "#/components/schemas/microsoft.graph.configManagerCollection",
            "#microsoft.graph.connectedOrganization": "#/components/schemas/microsoft.graph.connectedOrganization",
            "#microsoft.graph.connectionOperation": "#/components/schemas/microsoft.graph.connectionOperation",
            "#microsoft.graph.connector": "#/components/schemas/microsoft.graph.connector",
            "#microsoft.graph.connectorGroup": "#/components/schemas/microsoft.graph.connectorGroup",
            "#microsoft.graph.contact": "#/components/schemas/microsoft.graph.contact",
            "#microsoft.graph.contactFolder": "#/components/schemas/microsoft.graph.contactFolder",
            "#microsoft.graph.contactMergeSuggestions": "#/components/schemas/microsoft.graph.contactMergeSuggestions",
            "#microsoft.graph.contentSharingSession": "#/components/schemas/microsoft.graph.contentSharingSession",
            "#microsoft.graph.contentType": "#/components/schemas/microsoft.graph.contentType",
            "#microsoft.graph.continuousAccessEvaluationPolicy": "#/components/schemas/microsoft.graph.continuousAccessEvaluationPolicy",
            "#microsoft.graph.contract": "#/components/schemas/microsoft.graph.contract",
            "#microsoft.graph.conversation": "#/components/schemas/microsoft.graph.conversation",
            "#microsoft.graph.conversationMember": "#/components/schemas/microsoft.graph.conversationMember",
            "#microsoft.graph.conversationThread": "#/components/schemas/microsoft.graph.conversationThread",
            "#microsoft.graph.corsConfiguration_v2": "#/components/schemas/microsoft.graph.corsConfiguration_v2",
            "#microsoft.graph.countryNamedLocation": "#/components/schemas/microsoft.graph.countryNamedLocation",
            "#microsoft.graph.countryRegion": "#/components/schemas/microsoft.graph.countryRegion",
            "#microsoft.graph.credentialUsageSummary": "#/components/schemas/microsoft.graph.credentialUsageSummary",
            "#microsoft.graph.credentialUserRegistrationCount": "#/components/schemas/microsoft.graph.credentialUserRegistrationCount",
            "#microsoft.graph.credentialUserRegistrationDetails": "#/components/schemas/microsoft.graph.credentialUserRegistrationDetails",
            "#microsoft.graph.crossTenantAccessPolicy": "#/components/schemas/microsoft.graph.crossTenantAccessPolicy",
            "#microsoft.graph.crossTenantAccessPolicyConfigurationDefault": "#/components/schemas/microsoft.graph.crossTenantAccessPolicyConfigurationDefault",
            "#microsoft.graph.currency": "#/components/schemas/microsoft.graph.currency",
            "#microsoft.graph.customAccessPackageWorkflowExtension": "#/components/schemas/microsoft.graph.customAccessPackageWorkflowExtension",
            "#microsoft.graph.customAuthenticationExtension": "#/components/schemas/microsoft.graph.customAuthenticationExtension",
            "#microsoft.graph.customCalloutExtension": "#/components/schemas/microsoft.graph.customCalloutExtension",
            "#microsoft.graph.customExtensionHandler": "#/components/schemas/microsoft.graph.customExtensionHandler",
            "#microsoft.graph.customSecurityAttributeDefinition": "#/components/schemas/microsoft.graph.customSecurityAttributeDefinition",
            "#microsoft.graph.customer": "#/components/schemas/microsoft.graph.customer",
            "#microsoft.graph.customerPayment": "#/components/schemas/microsoft.graph.customerPayment",
            "#microsoft.graph.customerPaymentJournal": "#/components/schemas/microsoft.graph.customerPaymentJournal",
            "#microsoft.graph.dataClassificationService": "#/components/schemas/microsoft.graph.dataClassificationService",
            "#microsoft.graph.dataLossPreventionPolicy": "#/components/schemas/microsoft.graph.dataLossPreventionPolicy",
            "#microsoft.graph.dataPolicyOperation": "#/components/schemas/microsoft.graph.dataPolicyOperation",
            "#microsoft.graph.dataSharingConsent": "#/components/schemas/microsoft.graph.dataSharingConsent",
            "#microsoft.graph.defaultDeviceCompliancePolicy": "#/components/schemas/microsoft.graph.defaultDeviceCompliancePolicy",
            "#microsoft.graph.defaultManagedAppProtection": "#/components/schemas/microsoft.graph.defaultManagedAppProtection",
            "#microsoft.graph.defaultUserRoleOverride": "#/components/schemas/microsoft.graph.defaultUserRoleOverride",
            "#microsoft.graph.delegatedAdminAccessAssignment": "#/components/schemas/microsoft.graph.delegatedAdminAccessAssignment",
            "#microsoft.graph.delegatedAdminCustomer": "#/components/schemas/microsoft.graph.delegatedAdminCustomer",
            "#microsoft.graph.delegatedAdminRelationship": "#/components/schemas/microsoft.graph.delegatedAdminRelationship",
            "#microsoft.graph.delegatedAdminRelationshipOperation": "#/components/schemas/microsoft.graph.delegatedAdminRelationshipOperation",
            "#microsoft.graph.delegatedAdminRelationshipRequest": "#/components/schemas/microsoft.graph.delegatedAdminRelationshipRequest",
            "#microsoft.graph.delegatedAdminServiceManagementDetail": "#/components/schemas/microsoft.graph.delegatedAdminServiceManagementDetail",
            "#microsoft.graph.delegatedPermissionClassification": "#/components/schemas/microsoft.graph.delegatedPermissionClassification",
            "#microsoft.graph.deletedItemContainer": "#/components/schemas/microsoft.graph.deletedItemContainer",
            "#microsoft.graph.deletedTeam": "#/components/schemas/microsoft.graph.deletedTeam",
            "#microsoft.graph.depEnrollmentBaseProfile": "#/components/schemas/microsoft.graph.depEnrollmentBaseProfile",
            "#microsoft.graph.depEnrollmentProfile": "#/components/schemas/microsoft.graph.depEnrollmentProfile",
            "#microsoft.graph.depIOSEnrollmentProfile": "#/components/schemas/microsoft.graph.depIOSEnrollmentProfile",
            "#microsoft.graph.depMacOSEnrollmentProfile": "#/components/schemas/microsoft.graph.depMacOSEnrollmentProfile",
            "#microsoft.graph.depOnboardingSetting": "#/components/schemas/microsoft.graph.depOnboardingSetting",
            "#microsoft.graph.detectedApp": "#/components/schemas/microsoft.graph.detectedApp",
            "#microsoft.graph.device": "#/components/schemas/microsoft.graph.device",
            "#microsoft.graph.deviceAndAppManagementAssignmentFilter": "#/components/schemas/microsoft.graph.deviceAndAppManagementAssignmentFilter",
            "#microsoft.graph.deviceAndAppManagementRoleAssignment": "#/components/schemas/microsoft.graph.deviceAndAppManagementRoleAssignment",
            "#microsoft.graph.deviceAndAppManagementRoleDefinition": "#/components/schemas/microsoft.graph.deviceAndAppManagementRoleDefinition",
            "#microsoft.graph.deviceAppManagement": "#/components/schemas/microsoft.graph.deviceAppManagement",
            "#microsoft.graph.deviceAppManagementTask": "#/components/schemas/microsoft.graph.deviceAppManagementTask",
            "#microsoft.graph.deviceCategory": "#/components/schemas/microsoft.graph.deviceCategory",
            "#microsoft.graph.deviceComanagementAuthorityConfiguration": "#/components/schemas/microsoft.graph.deviceComanagementAuthorityConfiguration",
            "#microsoft.graph.deviceComplianceActionItem": "#/components/schemas/microsoft.graph.deviceComplianceActionItem",
            "#microsoft.graph.deviceComplianceDeviceOverview": "#/components/schemas/microsoft.graph.deviceComplianceDeviceOverview",
            "#microsoft.graph.deviceComplianceDeviceStatus": "#/components/schemas/microsoft.graph.deviceComplianceDeviceStatus",
            "#microsoft.graph.deviceCompliancePolicy": "#/components/schemas/microsoft.graph.deviceCompliancePolicy",
            "#microsoft.graph.deviceCompliancePolicyAssignment": "#/components/schemas/microsoft.graph.deviceCompliancePolicyAssignment",
            "#microsoft.graph.deviceCompliancePolicyDeviceStateSummary": "#/components/schemas/microsoft.graph.deviceCompliancePolicyDeviceStateSummary",
            "#microsoft.graph.deviceCompliancePolicyGroupAssignment": "#/components/schemas/microsoft.graph.deviceCompliancePolicyGroupAssignment",
            "#microsoft.graph.deviceCompliancePolicyPolicySetItem": "#/components/schemas/microsoft.graph.deviceCompliancePolicyPolicySetItem",
            "#microsoft.graph.deviceCompliancePolicySettingStateSummary": "#/components/schemas/microsoft.graph.deviceCompliancePolicySettingStateSummary",
            "#microsoft.graph.deviceCompliancePolicyState": "#/components/schemas/microsoft.graph.deviceCompliancePolicyState",
            "#microsoft.graph.deviceComplianceScheduledActionForRule": "#/components/schemas/microsoft.graph.deviceComplianceScheduledActionForRule",
            "#microsoft.graph.deviceComplianceScript": "#/components/schemas/microsoft.graph.deviceComplianceScript",
            "#microsoft.graph.deviceComplianceScriptDeviceState": "#/components/schemas/microsoft.graph.deviceComplianceScriptDeviceState",
            "#microsoft.graph.deviceComplianceScriptRunSummary": "#/components/schemas/microsoft.graph.deviceComplianceScriptRunSummary",
            "#microsoft.graph.deviceComplianceSettingState": "#/components/schemas/microsoft.graph.deviceComplianceSettingState",
            "#microsoft.graph.deviceComplianceUserOverview": "#/components/schemas/microsoft.graph.deviceComplianceUserOverview",
            "#microsoft.graph.deviceComplianceUserStatus": "#/components/schemas/microsoft.graph.deviceComplianceUserStatus",
            "#microsoft.graph.deviceConfiguration": "#/components/schemas/microsoft.graph.deviceConfiguration",
            "#microsoft.graph.deviceConfigurationAssignment": "#/components/schemas/microsoft.graph.deviceConfigurationAssignment",
            "#microsoft.graph.deviceConfigurationConflictSummary": "#/components/schemas/microsoft.graph.deviceConfigurationConflictSummary",
            "#microsoft.graph.deviceConfigurationDeviceOverview": "#/components/schemas/microsoft.graph.deviceConfigurationDeviceOverview",
            "#microsoft.graph.deviceConfigurationDeviceStateSummary": "#/components/schemas/microsoft.graph.deviceConfigurationDeviceStateSummary",
            "#microsoft.graph.deviceConfigurationDeviceStatus": "#/components/schemas/microsoft.graph.deviceConfigurationDeviceStatus",
            "#microsoft.graph.deviceConfigurationGroupAssignment": "#/components/schemas/microsoft.graph.deviceConfigurationGroupAssignment",
            "#microsoft.graph.deviceConfigurationPolicySetItem": "#/components/schemas/microsoft.graph.deviceConfigurationPolicySetItem",
            "#microsoft.graph.deviceConfigurationState": "#/components/schemas/microsoft.graph.deviceConfigurationState",
            "#microsoft.graph.deviceConfigurationUserOverview": "#/components/schemas/microsoft.graph.deviceConfigurationUserOverview",
            "#microsoft.graph.deviceConfigurationUserStateSummary": "#/components/schemas/microsoft.graph.deviceConfigurationUserStateSummary",
            "#microsoft.graph.deviceConfigurationUserStatus": "#/components/schemas/microsoft.graph.deviceConfigurationUserStatus",
            "#microsoft.graph.deviceCustomAttributeShellScript": "#/components/schemas/microsoft.graph.deviceCustomAttributeShellScript",
            "#microsoft.graph.deviceEnrollmentConfiguration": "#/components/schemas/microsoft.graph.deviceEnrollmentConfiguration",
            "#microsoft.graph.deviceEnrollmentLimitConfiguration": "#/components/schemas/microsoft.graph.deviceEnrollmentLimitConfiguration",
            "#microsoft.graph.deviceEnrollmentNotificationConfiguration": "#/components/schemas/microsoft.graph.deviceEnrollmentNotificationConfiguration",
            "#microsoft.graph.deviceEnrollmentPlatformRestrictionConfiguration": "#/components/schemas/microsoft.graph.deviceEnrollmentPlatformRestrictionConfiguration",
            "#microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration": "#/components/schemas/microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration",
            "#microsoft.graph.deviceEnrollmentWindowsHelloForBusinessConfiguration": "#/components/schemas/microsoft.graph.deviceEnrollmentWindowsHelloForBusinessConfiguration",
            "#microsoft.graph.deviceHealthScript": "#/components/schemas/microsoft.graph.deviceHealthScript",
            "#microsoft.graph.deviceHealthScriptAssignment": "#/components/schemas/microsoft.graph.deviceHealthScriptAssignment",
            "#microsoft.graph.deviceHealthScriptDeviceState": "#/components/schemas/microsoft.graph.deviceHealthScriptDeviceState",
            "#microsoft.graph.deviceHealthScriptRunSummary": "#/components/schemas/microsoft.graph.deviceHealthScriptRunSummary",
            "#microsoft.graph.deviceInstallState": "#/components/schemas/microsoft.graph.deviceInstallState",
            "#microsoft.graph.deviceLogCollectionResponse": "#/components/schemas/microsoft.graph.deviceLogCollectionResponse",
            "#microsoft.graph.deviceManagement": "#/components/schemas/microsoft.graph.deviceManagement",
            "#microsoft.graph.deviceManagement.alertRecord": "#/components/schemas/microsoft.graph.deviceManagement.alertRecord",
            "#microsoft.graph.deviceManagement.alertRule": "#/components/schemas/microsoft.graph.deviceManagement.alertRule",
            "#microsoft.graph.deviceManagement.monitoring": "#/components/schemas/microsoft.graph.deviceManagement.monitoring",
            "#microsoft.graph.deviceManagementAbstractComplexSettingDefinition": "#/components/schemas/microsoft.graph.deviceManagementAbstractComplexSettingDefinition",
            "#microsoft.graph.deviceManagementAbstractComplexSettingInstance": "#/components/schemas/microsoft.graph.deviceManagementAbstractComplexSettingInstance",
            "#microsoft.graph.deviceManagementAutopilotEvent": "#/components/schemas/microsoft.graph.deviceManagementAutopilotEvent",
            "#microsoft.graph.deviceManagementAutopilotPolicyStatusDetail": "#/components/schemas/microsoft.graph.deviceManagementAutopilotPolicyStatusDetail",
            "#microsoft.graph.deviceManagementBooleanSettingInstance": "#/components/schemas/microsoft.graph.deviceManagementBooleanSettingInstance",
            "#microsoft.graph.deviceManagementCachedReportConfiguration": "#/components/schemas/microsoft.graph.deviceManagementCachedReportConfiguration",
            "#microsoft.graph.deviceManagementCollectionSettingDefinition": "#/components/schemas/microsoft.graph.deviceManagementCollectionSettingDefinition",
            "#microsoft.graph.deviceManagementCollectionSettingInstance": "#/components/schemas/microsoft.graph.deviceManagementCollectionSettingInstance",
            "#microsoft.graph.deviceManagementComplexSettingDefinition": "#/components/schemas/microsoft.graph.deviceManagementComplexSettingDefinition",
            "#microsoft.graph.deviceManagementComplexSettingInstance": "#/components/schemas/microsoft.graph.deviceManagementComplexSettingInstance",
            "#microsoft.graph.deviceManagementComplianceActionItem": "#/components/schemas/microsoft.graph.deviceManagementComplianceActionItem",
            "#microsoft.graph.deviceManagementCompliancePolicy": "#/components/schemas/microsoft.graph.deviceManagementCompliancePolicy",
            "#microsoft.graph.deviceManagementComplianceScheduledActionForRule": "#/components/schemas/microsoft.graph.deviceManagementComplianceScheduledActionForRule",
            "#microsoft.graph.deviceManagementConfigurationCategory": "#/components/schemas/microsoft.graph.deviceManagementConfigurationCategory",
            "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition": "#/components/schemas/microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
            "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition": "#/components/schemas/microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
            "#microsoft.graph.deviceManagementConfigurationPolicy": "#/components/schemas/microsoft.graph.deviceManagementConfigurationPolicy",
            "#microsoft.graph.deviceManagementConfigurationPolicyAssignment": "#/components/schemas/microsoft.graph.deviceManagementConfigurationPolicyAssignment",
            "#microsoft.graph.deviceManagementConfigurationPolicyPolicySetItem": "#/components/schemas/microsoft.graph.deviceManagementConfigurationPolicyPolicySetItem",
            "#microsoft.graph.deviceManagementConfigurationPolicyTemplate": "#/components/schemas/microsoft.graph.deviceManagementConfigurationPolicyTemplate",
            "#microsoft.graph.deviceManagementConfigurationRedirectSettingDefinition": "#/components/schemas/microsoft.graph.deviceManagementConfigurationRedirectSettingDefinition",
            "#microsoft.graph.deviceManagementConfigurationSetting": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSetting",
            "#microsoft.graph.deviceManagementConfigurationSettingDefinition": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingDefinition",
            "#microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingGroupCollectionDefinition",
            "#microsoft.graph.deviceManagementConfigurationSettingGroupDefinition": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingGroupDefinition",
            "#microsoft.graph.deviceManagementConfigurationSettingTemplate": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSettingTemplate",
            "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
            "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition": "#/components/schemas/microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
            "#microsoft.graph.deviceManagementDerivedCredentialSettings": "#/components/schemas/microsoft.graph.deviceManagementDerivedCredentialSettings",
            "#microsoft.graph.deviceManagementDomainJoinConnector": "#/components/schemas/microsoft.graph.deviceManagementDomainJoinConnector",
            "#microsoft.graph.deviceManagementExchangeConnector": "#/components/schemas/microsoft.graph.deviceManagementExchangeConnector",
            "#microsoft.graph.deviceManagementExchangeOnPremisesPolicy": "#/components/schemas/microsoft.graph.deviceManagementExchangeOnPremisesPolicy",
            "#microsoft.graph.deviceManagementExportJob": "#/components/schemas/microsoft.graph.deviceManagementExportJob",
            "#microsoft.graph.deviceManagementIntegerSettingInstance": "#/components/schemas/microsoft.graph.deviceManagementIntegerSettingInstance",
            "#microsoft.graph.deviceManagementIntent": "#/components/schemas/microsoft.graph.deviceManagementIntent",
            "#microsoft.graph.deviceManagementIntentAssignment": "#/components/schemas/microsoft.graph.deviceManagementIntentAssignment",
            "#microsoft.graph.deviceManagementIntentDeviceSettingStateSummary": "#/components/schemas/microsoft.graph.deviceManagementIntentDeviceSettingStateSummary",
            "#microsoft.graph.deviceManagementIntentDeviceState": "#/components/schemas/microsoft.graph.deviceManagementIntentDeviceState",
            "#microsoft.graph.deviceManagementIntentDeviceStateSummary": "#/components/schemas/microsoft.graph.deviceManagementIntentDeviceStateSummary",
            "#microsoft.graph.deviceManagementIntentSettingCategory": "#/components/schemas/microsoft.graph.deviceManagementIntentSettingCategory",
            "#microsoft.graph.deviceManagementIntentUserState": "#/components/schemas/microsoft.graph.deviceManagementIntentUserState",
            "#microsoft.graph.deviceManagementIntentUserStateSummary": "#/components/schemas/microsoft.graph.deviceManagementIntentUserStateSummary",
            "#microsoft.graph.deviceManagementPartner": "#/components/schemas/microsoft.graph.deviceManagementPartner",
            "#microsoft.graph.deviceManagementReports": "#/components/schemas/microsoft.graph.deviceManagementReports",
            "#microsoft.graph.deviceManagementResourceAccessProfileAssignment": "#/components/schemas/microsoft.graph.deviceManagementResourceAccessProfileAssignment",
            "#microsoft.graph.deviceManagementResourceAccessProfileBase": "#/components/schemas/microsoft.graph.deviceManagementResourceAccessProfileBase",
            "#microsoft.graph.deviceManagementReusablePolicySetting": "#/components/schemas/microsoft.graph.deviceManagementReusablePolicySetting",
            "#microsoft.graph.deviceManagementScript": "#/components/schemas/microsoft.graph.deviceManagementScript",
            "#microsoft.graph.deviceManagementScriptAssignment": "#/components/schemas/microsoft.graph.deviceManagementScriptAssignment",
            "#microsoft.graph.deviceManagementScriptDeviceState": "#/components/schemas/microsoft.graph.deviceManagementScriptDeviceState",
            "#microsoft.graph.deviceManagementScriptGroupAssignment": "#/components/schemas/microsoft.graph.deviceManagementScriptGroupAssignment",
            "#microsoft.graph.deviceManagementScriptPolicySetItem": "#/components/schemas/microsoft.graph.deviceManagementScriptPolicySetItem",
            "#microsoft.graph.deviceManagementScriptRunSummary": "#/components/schemas/microsoft.graph.deviceManagementScriptRunSummary",
            "#microsoft.graph.deviceManagementScriptUserState": "#/components/schemas/microsoft.graph.deviceManagementScriptUserState",
            "#microsoft.graph.deviceManagementSettingCategory": "#/components/schemas/microsoft.graph.deviceManagementSettingCategory",
            "#microsoft.graph.deviceManagementSettingDefinition": "#/components/schemas/microsoft.graph.deviceManagementSettingDefinition",
            "#microsoft.graph.deviceManagementSettingInstance": "#/components/schemas/microsoft.graph.deviceManagementSettingInstance",
            "#microsoft.graph.deviceManagementStringSettingInstance": "#/components/schemas/microsoft.graph.deviceManagementStringSettingInstance",
            "#microsoft.graph.deviceManagementTemplate": "#/components/schemas/microsoft.graph.deviceManagementTemplate",
            "#microsoft.graph.deviceManagementTemplateSettingCategory": "#/components/schemas/microsoft.graph.deviceManagementTemplateSettingCategory",
            "#microsoft.graph.deviceManagementTroubleshootingEvent": "#/components/schemas/microsoft.graph.deviceManagementTroubleshootingEvent",
            "#microsoft.graph.deviceRegistrationPolicy": "#/components/schemas/microsoft.graph.deviceRegistrationPolicy",
            "#microsoft.graph.deviceSetupConfiguration": "#/components/schemas/microsoft.graph.deviceSetupConfiguration",
            "#microsoft.graph.deviceShellScript": "#/components/schemas/microsoft.graph.deviceShellScript",
            "#microsoft.graph.dimension": "#/components/schemas/microsoft.graph.dimension",
            "#microsoft.graph.dimensionValue": "#/components/schemas/microsoft.graph.dimensionValue",
            "#microsoft.graph.directory": "#/components/schemas/microsoft.graph.directory",
            "#microsoft.graph.directoryAudit": "#/components/schemas/microsoft.graph.directoryAudit",
            "#microsoft.graph.directoryDefinition": "#/components/schemas/microsoft.graph.directoryDefinition",
            "#microsoft.graph.directoryObject": "#/components/schemas/microsoft.graph.directoryObject",
            "#microsoft.graph.directoryObjectPartnerReference": "#/components/schemas/microsoft.graph.directoryObjectPartnerReference",
            "#microsoft.graph.directoryRole": "#/components/schemas/microsoft.graph.directoryRole",
            "#microsoft.graph.directoryRoleAccessReviewPolicy": "#/components/schemas/microsoft.graph.directoryRoleAccessReviewPolicy",
            "#microsoft.graph.directoryRoleTemplate": "#/components/schemas/microsoft.graph.directoryRoleTemplate",
            "#microsoft.graph.directorySetting": "#/components/schemas/microsoft.graph.directorySetting",
            "#microsoft.graph.directorySettingTemplate": "#/components/schemas/microsoft.graph.directorySettingTemplate",
            "#microsoft.graph.dlpEvaluatePoliciesJobResponse": "#/components/schemas/microsoft.graph.dlpEvaluatePoliciesJobResponse",
            "#microsoft.graph.document": "#/components/schemas/microsoft.graph.document",
            "#microsoft.graph.documentComment": "#/components/schemas/microsoft.graph.documentComment",
            "#microsoft.graph.documentCommentReply": "#/components/schemas/microsoft.graph.documentCommentReply",
            "#microsoft.graph.documentSetVersion": "#/components/schemas/microsoft.graph.documentSetVersion",
            "#microsoft.graph.domain": "#/components/schemas/microsoft.graph.domain",
            "#microsoft.graph.domainDnsCnameRecord": "#/components/schemas/microsoft.graph.domainDnsCnameRecord",
            "#microsoft.graph.domainDnsMxRecord": "#/components/schemas/microsoft.graph.domainDnsMxRecord",
            "#microsoft.graph.domainDnsRecord": "#/components/schemas/microsoft.graph.domainDnsRecord",
            "#microsoft.graph.domainDnsSrvRecord": "#/components/schemas/microsoft.graph.domainDnsSrvRecord",
            "#microsoft.graph.domainDnsTxtRecord": "#/components/schemas/microsoft.graph.domainDnsTxtRecord",
            "#microsoft.graph.domainDnsUnavailableRecord": "#/components/schemas/microsoft.graph.domainDnsUnavailableRecord",
            "#microsoft.graph.domainSecurityProfile": "#/components/schemas/microsoft.graph.domainSecurityProfile",
            "#microsoft.graph.drive": "#/components/schemas/microsoft.graph.drive",
            "#microsoft.graph.driveItem": "#/components/schemas/microsoft.graph.driveItem",
            "#microsoft.graph.driveItemVersion": "#/components/schemas/microsoft.graph.driveItemVersion",
            "#microsoft.graph.eBookInstallSummary": "#/components/schemas/microsoft.graph.eBookInstallSummary",
            "#microsoft.graph.easEmailProfileConfigurationBase": "#/components/schemas/microsoft.graph.easEmailProfileConfigurationBase",
            "#microsoft.graph.edge": "#/components/schemas/microsoft.graph.edge",
            "#microsoft.graph.ediscovery.addToReviewSetOperation": "#/components/schemas/microsoft.graph.ediscovery.addToReviewSetOperation",
            "#microsoft.graph.ediscovery.case": "#/components/schemas/microsoft.graph.ediscovery.case",
            "#microsoft.graph.ediscovery.caseExportOperation": "#/components/schemas/microsoft.graph.ediscovery.caseExportOperation",
            "#microsoft.graph.ediscovery.caseHoldOperation": "#/components/schemas/microsoft.graph.ediscovery.caseHoldOperation",
            "#microsoft.graph.ediscovery.caseIndexOperation": "#/components/schemas/microsoft.graph.ediscovery.caseIndexOperation",
            "#microsoft.graph.ediscovery.caseOperation": "#/components/schemas/microsoft.graph.ediscovery.caseOperation",
            "#microsoft.graph.ediscovery.caseSettings": "#/components/schemas/microsoft.graph.ediscovery.caseSettings",
            "#microsoft.graph.ediscovery.custodian": "#/components/schemas/microsoft.graph.ediscovery.custodian",
            "#microsoft.graph.ediscovery.dataSource": "#/components/schemas/microsoft.graph.ediscovery.dataSource",
            "#microsoft.graph.ediscovery.dataSourceContainer": "#/components/schemas/microsoft.graph.ediscovery.dataSourceContainer",
            "#microsoft.graph.ediscovery.ediscoveryroot": "#/components/schemas/microsoft.graph.ediscovery.ediscoveryroot",
            "#microsoft.graph.ediscovery.estimateStatisticsOperation": "#/components/schemas/microsoft.graph.ediscovery.estimateStatisticsOperation",
            "#microsoft.graph.ediscovery.legalHold": "#/components/schemas/microsoft.graph.ediscovery.legalHold",
            "#microsoft.graph.ediscovery.noncustodialDataSource": "#/components/schemas/microsoft.graph.ediscovery.noncustodialDataSource",
            "#microsoft.graph.ediscovery.purgeDataOperation": "#/components/schemas/microsoft.graph.ediscovery.purgeDataOperation",
            "#microsoft.graph.ediscovery.reviewSet": "#/components/schemas/microsoft.graph.ediscovery.reviewSet",
            "#microsoft.graph.ediscovery.reviewSetQuery": "#/components/schemas/microsoft.graph.ediscovery.reviewSetQuery",
            "#microsoft.graph.ediscovery.siteSource": "#/components/schemas/microsoft.graph.ediscovery.siteSource",
            "#microsoft.graph.ediscovery.sourceCollection": "#/components/schemas/microsoft.graph.ediscovery.sourceCollection",
            "#microsoft.graph.ediscovery.tag": "#/components/schemas/microsoft.graph.ediscovery.tag",
            "#microsoft.graph.ediscovery.tagOperation": "#/components/schemas/microsoft.graph.ediscovery.tagOperation",
            "#microsoft.graph.ediscovery.unifiedGroupSource": "#/components/schemas/microsoft.graph.ediscovery.unifiedGroupSource",
            "#microsoft.graph.ediscovery.userSource": "#/components/schemas/microsoft.graph.ediscovery.userSource",
            "#microsoft.graph.editionUpgradeConfiguration": "#/components/schemas/microsoft.graph.editionUpgradeConfiguration",
            "#microsoft.graph.educationAssignment": "#/components/schemas/microsoft.graph.educationAssignment",
            "#microsoft.graph.educationAssignmentDefaults": "#/components/schemas/microsoft.graph.educationAssignmentDefaults",
            "#microsoft.graph.educationAssignmentResource": "#/components/schemas/microsoft.graph.educationAssignmentResource",
            "#microsoft.graph.educationAssignmentSettings": "#/components/schemas/microsoft.graph.educationAssignmentSettings",
            "#microsoft.graph.educationCategory": "#/components/schemas/microsoft.graph.educationCategory",
            "#microsoft.graph.educationClass": "#/components/schemas/microsoft.graph.educationClass",
            "#microsoft.graph.educationFeedbackOutcome": "#/components/schemas/microsoft.graph.educationFeedbackOutcome",
            "#microsoft.graph.educationFeedbackResourceOutcome": "#/components/schemas/microsoft.graph.educationFeedbackResourceOutcome",
            "#microsoft.graph.educationOrganization": "#/components/schemas/microsoft.graph.educationOrganization",
            "#microsoft.graph.educationOutcome": "#/components/schemas/microsoft.graph.educationOutcome",
            "#microsoft.graph.educationPointsOutcome": "#/components/schemas/microsoft.graph.educationPointsOutcome",
            "#microsoft.graph.educationRubric": "#/components/schemas/microsoft.graph.educationRubric",
            "#microsoft.graph.educationRubricOutcome": "#/components/schemas/microsoft.graph.educationRubricOutcome",
            "#microsoft.graph.educationSchool": "#/components/schemas/microsoft.graph.educationSchool",
            "#microsoft.graph.educationSubmission": "#/components/schemas/microsoft.graph.educationSubmission",
            "#microsoft.graph.educationSubmissionResource": "#/components/schemas/microsoft.graph.educationSubmissionResource",
            "#microsoft.graph.educationSynchronizationError": "#/components/schemas/microsoft.graph.educationSynchronizationError",
            "#microsoft.graph.educationSynchronizationProfile": "#/components/schemas/microsoft.graph.educationSynchronizationProfile",
            "#microsoft.graph.educationSynchronizationProfileStatus": "#/components/schemas/microsoft.graph.educationSynchronizationProfileStatus",
            "#microsoft.graph.educationUser": "#/components/schemas/microsoft.graph.educationUser",
            "#microsoft.graph.educationalActivity": "#/components/schemas/microsoft.graph.educationalActivity",
            "#microsoft.graph.emailActivityStatistics": "#/components/schemas/microsoft.graph.emailActivityStatistics",
            "#microsoft.graph.emailAuthenticationMethod": "#/components/schemas/microsoft.graph.emailAuthenticationMethod",
            "#microsoft.graph.emailAuthenticationMethodConfiguration": "#/components/schemas/microsoft.graph.emailAuthenticationMethodConfiguration",
            "#microsoft.graph.emailFileAssessmentRequest": "#/components/schemas/microsoft.graph.emailFileAssessmentRequest",
            "#microsoft.graph.embeddedSIMActivationCodePool": "#/components/schemas/microsoft.graph.embeddedSIMActivationCodePool",
            "#microsoft.graph.embeddedSIMActivationCodePoolAssignment": "#/components/schemas/microsoft.graph.embeddedSIMActivationCodePoolAssignment",
            "#microsoft.graph.embeddedSIMDeviceState": "#/components/schemas/microsoft.graph.embeddedSIMDeviceState",
            "#microsoft.graph.employee": "#/components/schemas/microsoft.graph.employee",
            "#microsoft.graph.endpoint": "#/components/schemas/microsoft.graph.endpoint",
            "#microsoft.graph.enrollmentConfigurationAssignment": "#/components/schemas/microsoft.graph.enrollmentConfigurationAssignment",
            "#microsoft.graph.enrollmentProfile": "#/components/schemas/microsoft.graph.enrollmentProfile",
            "#microsoft.graph.enrollmentRestrictionsConfigurationPolicySetItem": "#/components/schemas/microsoft.graph.enrollmentRestrictionsConfigurationPolicySetItem",
            "#microsoft.graph.enrollmentTroubleshootingEvent": "#/components/schemas/microsoft.graph.enrollmentTroubleshootingEvent",
            "#microsoft.graph.enterpriseCodeSigningCertificate": "#/components/schemas/microsoft.graph.enterpriseCodeSigningCertificate",
            "#microsoft.graph.entitlementManagement": "#/components/schemas/microsoft.graph.entitlementManagement",
            "#microsoft.graph.entitlementManagementSettings": "#/components/schemas/microsoft.graph.entitlementManagementSettings",
            "#microsoft.graph.evaluateLabelJobResponse": "#/components/schemas/microsoft.graph.evaluateLabelJobResponse",
            "#microsoft.graph.event": "#/components/schemas/microsoft.graph.event",
            "#microsoft.graph.eventMessage": "#/components/schemas/microsoft.graph.eventMessage",
            "#microsoft.graph.eventMessageRequest": "#/components/schemas/microsoft.graph.eventMessageRequest",
            "#microsoft.graph.eventMessageResponse": "#/components/schemas/microsoft.graph.eventMessageResponse",
            "#microsoft.graph.exactMatchDataStore": "#/components/schemas/microsoft.graph.exactMatchDataStore",
            "#microsoft.graph.exactMatchDataStoreBase": "#/components/schemas/microsoft.graph.exactMatchDataStoreBase",
            "#microsoft.graph.exactMatchJobBase": "#/components/schemas/microsoft.graph.exactMatchJobBase",
            "#microsoft.graph.exactMatchLookupJob": "#/components/schemas/microsoft.graph.exactMatchLookupJob",
            "#microsoft.graph.exactMatchSession": "#/components/schemas/microsoft.graph.exactMatchSession",
            "#microsoft.graph.exactMatchSessionBase": "#/components/schemas/microsoft.graph.exactMatchSessionBase",
            "#microsoft.graph.exactMatchUploadAgent": "#/components/schemas/microsoft.graph.exactMatchUploadAgent",
            "#microsoft.graph.extension": "#/components/schemas/microsoft.graph.extension",
            "#microsoft.graph.extensionProperty": "#/components/schemas/microsoft.graph.extensionProperty",
            "#microsoft.graph.external": "#/components/schemas/microsoft.graph.external",
            "#microsoft.graph.externalConnection": "#/components/schemas/microsoft.graph.externalConnection",
            "#microsoft.graph.externalConnectors.connectionOperation": "#/components/schemas/microsoft.graph.externalConnectors.connectionOperation",
            "#microsoft.graph.externalConnectors.connectionQuota": "#/components/schemas/microsoft.graph.externalConnectors.connectionQuota",
            "#microsoft.graph.externalConnectors.externalActivity": "#/components/schemas/microsoft.graph.externalConnectors.externalActivity",
            "#microsoft.graph.externalConnectors.externalActivityResult": "#/components/schemas/microsoft.graph.externalConnectors.externalActivityResult",
            "#microsoft.graph.externalConnectors.externalConnection": "#/components/schemas/microsoft.graph.externalConnectors.externalConnection",
            "#microsoft.graph.externalConnectors.externalGroup": "#/components/schemas/microsoft.graph.externalConnectors.externalGroup",
            "#microsoft.graph.externalConnectors.externalItem": "#/components/schemas/microsoft.graph.externalConnectors.externalItem",
            "#microsoft.graph.externalConnectors.identity": "#/components/schemas/microsoft.graph.externalConnectors.identity",
            "#microsoft.graph.externalConnectors.schema": "#/components/schemas/microsoft.graph.externalConnectors.schema",
            "#microsoft.graph.externalDomainName": "#/components/schemas/microsoft.graph.externalDomainName",
            "#microsoft.graph.externalGroup": "#/components/schemas/microsoft.graph.externalGroup",
            "#microsoft.graph.externalIdentitiesPolicy": "#/components/schemas/microsoft.graph.externalIdentitiesPolicy",
            "#microsoft.graph.externalItem": "#/components/schemas/microsoft.graph.externalItem",
            "#microsoft.graph.externalMeetingRegistrant": "#/components/schemas/microsoft.graph.externalMeetingRegistrant",
            "#microsoft.graph.externalMeetingRegistration": "#/components/schemas/microsoft.graph.externalMeetingRegistration",
            "#microsoft.graph.featureRolloutPolicy": "#/components/schemas/microsoft.graph.featureRolloutPolicy",
            "#microsoft.graph.federatedIdentityCredential": "#/components/schemas/microsoft.graph.federatedIdentityCredential",
            "#microsoft.graph.fido2AuthenticationMethod": "#/components/schemas/microsoft.graph.fido2AuthenticationMethod",
            "#microsoft.graph.fido2AuthenticationMethodConfiguration": "#/components/schemas/microsoft.graph.fido2AuthenticationMethodConfiguration",
            "#microsoft.graph.fido2CombinationConfiguration": "#/components/schemas/microsoft.graph.fido2CombinationConfiguration",
            "#microsoft.graph.fieldValueSet": "#/components/schemas/microsoft.graph.fieldValueSet",
            "#microsoft.graph.fileAssessmentRequest": "#/components/schemas/microsoft.graph.fileAssessmentRequest",
            "#microsoft.graph.fileAttachment": "#/components/schemas/microsoft.graph.fileAttachment",
            "#microsoft.graph.fileClassificationRequest": "#/components/schemas/microsoft.graph.fileClassificationRequest",
            "#microsoft.graph.fileSecurityProfile": "#/components/schemas/microsoft.graph.fileSecurityProfile",
            "#microsoft.graph.filterOperatorSchema": "#/components/schemas/microsoft.graph.filterOperatorSchema",
            "#microsoft.graph.focusActivityStatistics": "#/components/schemas/microsoft.graph.focusActivityStatistics",
            "#microsoft.graph.generalLedgerEntry": "#/components/schemas/microsoft.graph.generalLedgerEntry",
            "#microsoft.graph.governanceInsight": "#/components/schemas/microsoft.graph.governanceInsight",
            "#microsoft.graph.governancePolicyTemplate": "#/components/schemas/microsoft.graph.governancePolicyTemplate",
            "#microsoft.graph.governanceResource": "#/components/schemas/microsoft.graph.governanceResource",
            "#microsoft.graph.governanceRoleAssignment": "#/components/schemas/microsoft.graph.governanceRoleAssignment",
            "#microsoft.graph.governanceRoleAssignmentRequest": "#/components/schemas/microsoft.graph.governanceRoleAssignmentRequest",
            "#microsoft.graph.governanceRoleDefinition": "#/components/schemas/microsoft.graph.governanceRoleDefinition",
            "#microsoft.graph.governanceRoleSetting": "#/components/schemas/microsoft.graph.governanceRoleSetting",
            "#microsoft.graph.governanceSubject": "#/components/schemas/microsoft.graph.governanceSubject",
            "#microsoft.graph.group": "#/components/schemas/microsoft.graph.group",
            "#microsoft.graph.groupLifecyclePolicy": "#/components/schemas/microsoft.graph.groupLifecyclePolicy",
            "#microsoft.graph.groupPolicyCategory": "#/components/schemas/microsoft.graph.groupPolicyCategory",
            "#microsoft.graph.groupPolicyConfiguration": "#/components/schemas/microsoft.graph.groupPolicyConfiguration",
            "#microsoft.graph.groupPolicyConfigurationAssignment": "#/components/schemas/microsoft.graph.groupPolicyConfigurationAssignment",
            "#microsoft.graph.groupPolicyDefinition": "#/components/schemas/microsoft.graph.groupPolicyDefinition",
            "#microsoft.graph.groupPolicyDefinitionFile": "#/components/schemas/microsoft.graph.groupPolicyDefinitionFile",
            "#microsoft.graph.groupPolicyDefinitionValue": "#/components/schemas/microsoft.graph.groupPolicyDefinitionValue",
            "#microsoft.graph.groupPolicyMigrationReport": "#/components/schemas/microsoft.graph.groupPolicyMigrationReport",
            "#microsoft.graph.groupPolicyObjectFile": "#/components/schemas/microsoft.graph.groupPolicyObjectFile",
            "#microsoft.graph.groupPolicyOperation": "#/components/schemas/microsoft.graph.groupPolicyOperation",
            "#microsoft.graph.groupPolicyPresentation": "#/components/schemas/microsoft.graph.groupPolicyPresentation",
            "#microsoft.graph.groupPolicyPresentationCheckBox": "#/components/schemas/microsoft.graph.groupPolicyPresentationCheckBox",
            "#microsoft.graph.groupPolicyPresentationComboBox": "#/components/schemas/microsoft.graph.groupPolicyPresentationComboBox",
            "#microsoft.graph.groupPolicyPresentationDecimalTextBox": "#/components/schemas/microsoft.graph.groupPolicyPresentationDecimalTextBox",
            "#microsoft.graph.groupPolicyPresentationDropdownList": "#/components/schemas/microsoft.graph.groupPolicyPresentationDropdownList",
            "#microsoft.graph.groupPolicyPresentationListBox": "#/components/schemas/microsoft.graph.groupPolicyPresentationListBox",
            "#microsoft.graph.groupPolicyPresentationLongDecimalTextBox": "#/components/schemas/microsoft.graph.groupPolicyPresentationLongDecimalTextBox",
            "#microsoft.graph.groupPolicyPresentationMultiTextBox": "#/components/schemas/microsoft.graph.groupPolicyPresentationMultiTextBox",
            "#microsoft.graph.groupPolicyPresentationText": "#/components/schemas/microsoft.graph.groupPolicyPresentationText",
            "#microsoft.graph.groupPolicyPresentationTextBox": "#/components/schemas/microsoft.graph.groupPolicyPresentationTextBox",
            "#microsoft.graph.groupPolicyPresentationValue": "#/components/schemas/microsoft.graph.groupPolicyPresentationValue",
            "#microsoft.graph.groupPolicyPresentationValueBoolean": "#/components/schemas/microsoft.graph.groupPolicyPresentationValueBoolean",
            "#microsoft.graph.groupPolicyPresentationValueDecimal": "#/components/schemas/microsoft.graph.groupPolicyPresentationValueDecimal",
            "#microsoft.graph.groupPolicyPresentationValueList": "#/components/schemas/microsoft.graph.groupPolicyPresentationValueList",
            "#microsoft.graph.groupPolicyPresentationValueLongDecimal": "#/components/schemas/microsoft.graph.groupPolicyPresentationValueLongDecimal",
            "#microsoft.graph.groupPolicyPresentationValueMultiText": "#/components/schemas/microsoft.graph.groupPolicyPresentationValueMultiText",
            "#microsoft.graph.groupPolicyPresentationValueText": "#/components/schemas/microsoft.graph.groupPolicyPresentationValueText",
            "#microsoft.graph.groupPolicySettingMapping": "#/components/schemas/microsoft.graph.groupPolicySettingMapping",
            "#microsoft.graph.groupPolicyUploadedDefinitionFile": "#/components/schemas/microsoft.graph.groupPolicyUploadedDefinitionFile",
            "#microsoft.graph.groupPolicyUploadedPresentation": "#/components/schemas/microsoft.graph.groupPolicyUploadedPresentation",
            "#microsoft.graph.homeRealmDiscoveryPolicy": "#/components/schemas/microsoft.graph.homeRealmDiscoveryPolicy",
            "#microsoft.graph.horizontalSection": "#/components/schemas/microsoft.graph.horizontalSection",
            "#microsoft.graph.horizontalSectionColumn": "#/components/schemas/microsoft.graph.horizontalSectionColumn",
            "#microsoft.graph.hostSecurityProfile": "#/components/schemas/microsoft.graph.hostSecurityProfile",
            "#microsoft.graph.identityApiConnector": "#/components/schemas/microsoft.graph.identityApiConnector",
            "#microsoft.graph.identityBuiltInUserFlowAttribute": "#/components/schemas/microsoft.graph.identityBuiltInUserFlowAttribute",
            "#microsoft.graph.identityCustomUserFlowAttribute": "#/components/schemas/microsoft.graph.identityCustomUserFlowAttribute",
            "#microsoft.graph.identityGovernance.customTaskExtension": "#/components/schemas/microsoft.graph.identityGovernance.customTaskExtension",
            "#microsoft.graph.identityGovernance.lifecycleManagementSettings": "#/components/schemas/microsoft.graph.identityGovernance.lifecycleManagementSettings",
            "#microsoft.graph.identityGovernance.lifecycleWorkflowsContainer": "#/components/schemas/microsoft.graph.identityGovernance.lifecycleWorkflowsContainer",
            "#microsoft.graph.identityGovernance.run": "#/components/schemas/microsoft.graph.identityGovernance.run",
            "#microsoft.graph.identityGovernance.task": "#/components/schemas/microsoft.graph.identityGovernance.task",
            "#microsoft.graph.identityGovernance.taskDefinition": "#/components/schemas/microsoft.graph.identityGovernance.taskDefinition",
            "#microsoft.graph.identityGovernance.taskProcessingResult": "#/components/schemas/microsoft.graph.identityGovernance.taskProcessingResult",
            "#microsoft.graph.identityGovernance.taskReport": "#/components/schemas/microsoft.graph.identityGovernance.taskReport",
            "#microsoft.graph.identityGovernance.userProcessingResult": "#/components/schemas/microsoft.graph.identityGovernance.userProcessingResult",
            "#microsoft.graph.identityGovernance.workflowTemplate": "#/components/schemas/microsoft.graph.identityGovernance.workflowTemplate",
            "#microsoft.graph.identityProvider": "#/components/schemas/microsoft.graph.identityProvider",
            "#microsoft.graph.identityProviderBase": "#/components/schemas/microsoft.graph.identityProviderBase",
            "#microsoft.graph.identitySecurityDefaultsEnforcementPolicy": "#/components/schemas/microsoft.graph.identitySecurityDefaultsEnforcementPolicy",
            "#microsoft.graph.identityUserFlow": "#/components/schemas/microsoft.graph.identityUserFlow",
            "#microsoft.graph.identityUserFlowAttribute": "#/components/schemas/microsoft.graph.identityUserFlowAttribute",
            "#microsoft.graph.identityUserFlowAttributeAssignment": "#/components/schemas/microsoft.graph.identityUserFlowAttributeAssignment",
            "#microsoft.graph.impactedResource": "#/components/schemas/microsoft.graph.impactedResource",
            "#microsoft.graph.importedAppleDeviceIdentity": "#/components/schemas/microsoft.graph.importedAppleDeviceIdentity",
            "#microsoft.graph.importedAppleDeviceIdentityResult": "#/components/schemas/microsoft.graph.importedAppleDeviceIdentityResult",
            "#microsoft.graph.importedDeviceIdentity": "#/components/schemas/microsoft.graph.importedDeviceIdentity",
            "#microsoft.graph.importedDeviceIdentityResult": "#/components/schemas/microsoft.graph.importedDeviceIdentityResult",
            "#microsoft.graph.importedWindowsAutopilotDeviceIdentity": "#/components/schemas/microsoft.graph.importedWindowsAutopilotDeviceIdentity",
            "#microsoft.graph.importedWindowsAutopilotDeviceIdentityUpload": "#/components/schemas/microsoft.graph.importedWindowsAutopilotDeviceIdentityUpload",
            "#microsoft.graph.inferenceClassification": "#/components/schemas/microsoft.graph.inferenceClassification",
            "#microsoft.graph.inferenceClassificationOverride": "#/components/schemas/microsoft.graph.inferenceClassificationOverride",
            "#microsoft.graph.informationProtection": "#/components/schemas/microsoft.graph.informationProtection",
            "#microsoft.graph.informationProtectionLabel": "#/components/schemas/microsoft.graph.informationProtectionLabel",
            "#microsoft.graph.informationProtectionPolicy": "#/components/schemas/microsoft.graph.informationProtectionPolicy",
            "#microsoft.graph.insightsSettings": "#/components/schemas/microsoft.graph.insightsSettings",
            "#microsoft.graph.internalDomainFederation": "#/components/schemas/microsoft.graph.internalDomainFederation",
            "#microsoft.graph.internetExplorerMode": "#/components/schemas/microsoft.graph.internetExplorerMode",
            "#microsoft.graph.intuneBrandingProfile": "#/components/schemas/microsoft.graph.intuneBrandingProfile",
            "#microsoft.graph.intuneBrandingProfileAssignment": "#/components/schemas/microsoft.graph.intuneBrandingProfileAssignment",
            "#microsoft.graph.invitation": "#/components/schemas/microsoft.graph.invitation",
            "#microsoft.graph.inviteParticipantsOperation": "#/components/schemas/microsoft.graph.inviteParticipantsOperation",
            "#microsoft.graph.invokeUserFlowListener": "#/components/schemas/microsoft.graph.invokeUserFlowListener",
            "#microsoft.graph.iosCertificateProfile": "#/components/schemas/microsoft.graph.iosCertificateProfile",
            "#microsoft.graph.iosCertificateProfileBase": "#/components/schemas/microsoft.graph.iosCertificateProfileBase",
            "#microsoft.graph.iosCompliancePolicy": "#/components/schemas/microsoft.graph.iosCompliancePolicy",
            "#microsoft.graph.iosCustomConfiguration": "#/components/schemas/microsoft.graph.iosCustomConfiguration",
            "#microsoft.graph.iosDerivedCredentialAuthenticationConfiguration": "#/components/schemas/microsoft.graph.iosDerivedCredentialAuthenticationConfiguration",
            "#microsoft.graph.iosDeviceFeaturesConfiguration": "#/components/schemas/microsoft.graph.iosDeviceFeaturesConfiguration",
            "#microsoft.graph.iosEasEmailProfileConfiguration": "#/components/schemas/microsoft.graph.iosEasEmailProfileConfiguration",
            "#microsoft.graph.iosEduDeviceConfiguration": "#/components/schemas/microsoft.graph.iosEduDeviceConfiguration",
            "#microsoft.graph.iosEducationDeviceConfiguration": "#/components/schemas/microsoft.graph.iosEducationDeviceConfiguration",
            "#microsoft.graph.iosEnterpriseWiFiConfiguration": "#/components/schemas/microsoft.graph.iosEnterpriseWiFiConfiguration",
            "#microsoft.graph.iosExpeditedCheckinConfiguration": "#/components/schemas/microsoft.graph.iosExpeditedCheckinConfiguration",
            "#microsoft.graph.iosGeneralDeviceConfiguration": "#/components/schemas/microsoft.graph.iosGeneralDeviceConfiguration",
            "#microsoft.graph.iosImportedPFXCertificateProfile": "#/components/schemas/microsoft.graph.iosImportedPFXCertificateProfile",
            "#microsoft.graph.iosLobApp": "#/components/schemas/microsoft.graph.iosLobApp",
            "#microsoft.graph.iosLobAppProvisioningConfiguration": "#/components/schemas/microsoft.graph.iosLobAppProvisioningConfiguration",
            "#microsoft.graph.iosLobAppProvisioningConfigurationAssignment": "#/components/schemas/microsoft.graph.iosLobAppProvisioningConfigurationAssignment",
            "#microsoft.graph.iosLobAppProvisioningConfigurationPolicySetItem": "#/components/schemas/microsoft.graph.iosLobAppProvisioningConfigurationPolicySetItem",
            "#microsoft.graph.iosManagedAppProtection": "#/components/schemas/microsoft.graph.iosManagedAppProtection",
            "#microsoft.graph.iosManagedAppRegistration": "#/components/schemas/microsoft.graph.iosManagedAppRegistration",
            "#microsoft.graph.iosMobileAppConfiguration": "#/components/schemas/microsoft.graph.iosMobileAppConfiguration",
            "#microsoft.graph.iosPkcsCertificateProfile": "#/components/schemas/microsoft.graph.iosPkcsCertificateProfile",
            "#microsoft.graph.iosScepCertificateProfile": "#/components/schemas/microsoft.graph.iosScepCertificateProfile",
            "#microsoft.graph.iosStoreApp": "#/components/schemas/microsoft.graph.iosStoreApp",
            "#microsoft.graph.iosTrustedRootCertificate": "#/components/schemas/microsoft.graph.iosTrustedRootCertificate",
            "#microsoft.graph.iosUpdateConfiguration": "#/components/schemas/microsoft.graph.iosUpdateConfiguration",
            "#microsoft.graph.iosUpdateDeviceStatus": "#/components/schemas/microsoft.graph.iosUpdateDeviceStatus",
            "#microsoft.graph.iosVpnConfiguration": "#/components/schemas/microsoft.graph.iosVpnConfiguration",
            "#microsoft.graph.iosVppApp": "#/components/schemas/microsoft.graph.iosVppApp",
            "#microsoft.graph.iosVppAppAssignedDeviceLicense": "#/components/schemas/microsoft.graph.iosVppAppAssignedDeviceLicense",
            "#microsoft.graph.iosVppAppAssignedLicense": "#/components/schemas/microsoft.graph.iosVppAppAssignedLicense",
            "#microsoft.graph.iosVppAppAssignedUserLicense": "#/components/schemas/microsoft.graph.iosVppAppAssignedUserLicense",
            "#microsoft.graph.iosVppEBook": "#/components/schemas/microsoft.graph.iosVppEBook",
            "#microsoft.graph.iosVppEBookAssignment": "#/components/schemas/microsoft.graph.iosVppEBookAssignment",
            "#microsoft.graph.iosWiFiConfiguration": "#/components/schemas/microsoft.graph.iosWiFiConfiguration",
            "#microsoft.graph.iosiPadOSWebClip": "#/components/schemas/microsoft.graph.iosiPadOSWebClip",
            "#microsoft.graph.iosikEv2VpnConfiguration": "#/components/schemas/microsoft.graph.iosikEv2VpnConfiguration",
            "#microsoft.graph.ipApplicationSegment": "#/components/schemas/microsoft.graph.ipApplicationSegment",
            "#microsoft.graph.ipNamedLocation": "#/components/schemas/microsoft.graph.ipNamedLocation",
            "#microsoft.graph.ipSecurityProfile": "#/components/schemas/microsoft.graph.ipSecurityProfile",
            "#microsoft.graph.item": "#/components/schemas/microsoft.graph.item",
            "#microsoft.graph.itemActivity": "#/components/schemas/microsoft.graph.itemActivity",
            "#microsoft.graph.itemActivityOLD": "#/components/schemas/microsoft.graph.itemActivityOLD",
            "#microsoft.graph.itemActivityStat": "#/components/schemas/microsoft.graph.itemActivityStat",
            "#microsoft.graph.itemAddress": "#/components/schemas/microsoft.graph.itemAddress",
            "#microsoft.graph.itemAnalytics": "#/components/schemas/microsoft.graph.itemAnalytics",
            "#microsoft.graph.itemAttachment": "#/components/schemas/microsoft.graph.itemAttachment",
            "#microsoft.graph.itemCategory": "#/components/schemas/microsoft.graph.itemCategory",
            "#microsoft.graph.itemEmail": "#/components/schemas/microsoft.graph.itemEmail",
            "#microsoft.graph.itemFacet": "#/components/schemas/microsoft.graph.itemFacet",
            "#microsoft.graph.itemInsights": "#/components/schemas/microsoft.graph.itemInsights",
            "#microsoft.graph.itemPatent": "#/components/schemas/microsoft.graph.itemPatent",
            "#microsoft.graph.itemPhone": "#/components/schemas/microsoft.graph.itemPhone",
            "#microsoft.graph.itemPublication": "#/components/schemas/microsoft.graph.itemPublication",
            "#microsoft.graph.jobResponseBase": "#/components/schemas/microsoft.graph.jobResponseBase",
            "#microsoft.graph.journal": "#/components/schemas/microsoft.graph.journal",
            "#microsoft.graph.journalLine": "#/components/schemas/microsoft.graph.journalLine",
            "#microsoft.graph.languageProficiency": "#/components/schemas/microsoft.graph.languageProficiency",
            "#microsoft.graph.learningContent": "#/components/schemas/microsoft.graph.learningContent",
            "#microsoft.graph.learningProvider": "#/components/schemas/microsoft.graph.learningProvider",
            "#microsoft.graph.licenseDetails": "#/components/schemas/microsoft.graph.licenseDetails",
            "#microsoft.graph.linkedResource": "#/components/schemas/microsoft.graph.linkedResource",
            "#microsoft.graph.list": "#/components/schemas/microsoft.graph.list",
            "#microsoft.graph.listItem": "#/components/schemas/microsoft.graph.listItem",
            "#microsoft.graph.listItemVersion": "#/components/schemas/microsoft.graph.listItemVersion",
            "#microsoft.graph.localizedNotificationMessage": "#/components/schemas/microsoft.graph.localizedNotificationMessage",
            "#microsoft.graph.longRunningOperation": "#/components/schemas/microsoft.graph.longRunningOperation",
            "#microsoft.graph.lookupResultRow": "#/components/schemas/microsoft.graph.lookupResultRow",
            "#microsoft.graph.macOSCertificateProfileBase": "#/components/schemas/microsoft.graph.macOSCertificateProfileBase",
            "#microsoft.graph.macOSCompliancePolicy": "#/components/schemas/microsoft.graph.macOSCompliancePolicy",
            "#microsoft.graph.macOSCustomAppConfiguration": "#/components/schemas/microsoft.graph.macOSCustomAppConfiguration",
            "#microsoft.graph.macOSCustomConfiguration": "#/components/schemas/microsoft.graph.macOSCustomConfiguration",
            "#microsoft.graph.macOSDeviceFeaturesConfiguration": "#/components/schemas/microsoft.graph.macOSDeviceFeaturesConfiguration",
            "#microsoft.graph.macOSDmgApp": "#/components/schemas/microsoft.graph.macOSDmgApp",
            "#microsoft.graph.macOSEndpointProtectionConfiguration": "#/components/schemas/microsoft.graph.macOSEndpointProtectionConfiguration",
            "#microsoft.graph.macOSEnterpriseWiFiConfiguration": "#/components/schemas/microsoft.graph.macOSEnterpriseWiFiConfiguration",
            "#microsoft.graph.macOSExtensionsConfiguration": "#/components/schemas/microsoft.graph.macOSExtensionsConfiguration",
            "#microsoft.graph.macOSGeneralDeviceConfiguration": "#/components/schemas/microsoft.graph.macOSGeneralDeviceConfiguration",
            "#microsoft.graph.macOSImportedPFXCertificateProfile": "#/components/schemas/microsoft.graph.macOSImportedPFXCertificateProfile",
            "#microsoft.graph.macOSLobApp": "#/components/schemas/microsoft.graph.macOSLobApp",
            "#microsoft.graph.macOSMdatpApp": "#/components/schemas/microsoft.graph.macOSMdatpApp",
            "#microsoft.graph.macOSMicrosoftDefenderApp": "#/components/schemas/microsoft.graph.macOSMicrosoftDefenderApp",
            "#microsoft.graph.macOSMicrosoftEdgeApp": "#/components/schemas/microsoft.graph.macOSMicrosoftEdgeApp",
            "#microsoft.graph.macOSOfficeSuiteApp": "#/components/schemas/microsoft.graph.macOSOfficeSuiteApp",
            "#microsoft.graph.macOSPkcsCertificateProfile": "#/components/schemas/microsoft.graph.macOSPkcsCertificateProfile",
            "#microsoft.graph.macOSScepCertificateProfile": "#/components/schemas/microsoft.graph.macOSScepCertificateProfile",
            "#microsoft.graph.macOSSoftwareUpdateAccountSummary": "#/components/schemas/microsoft.graph.macOSSoftwareUpdateAccountSummary",
            "#microsoft.graph.macOSSoftwareUpdateCategorySummary": "#/components/schemas/microsoft.graph.macOSSoftwareUpdateCategorySummary",
            "#microsoft.graph.macOSSoftwareUpdateConfiguration": "#/components/schemas/microsoft.graph.macOSSoftwareUpdateConfiguration",
            "#microsoft.graph.macOSSoftwareUpdateStateSummary": "#/components/schemas/microsoft.graph.macOSSoftwareUpdateStateSummary",
            "#microsoft.graph.macOSTrustedRootCertificate": "#/components/schemas/microsoft.graph.macOSTrustedRootCertificate",
            "#microsoft.graph.macOSVpnConfiguration": "#/components/schemas/microsoft.graph.macOSVpnConfiguration",
            "#microsoft.graph.macOSWiFiConfiguration": "#/components/schemas/microsoft.graph.macOSWiFiConfiguration",
            "#microsoft.graph.macOSWiredNetworkConfiguration": "#/components/schemas/microsoft.graph.macOSWiredNetworkConfiguration",
            "#microsoft.graph.macOsVppApp": "#/components/schemas/microsoft.graph.macOsVppApp",
            "#microsoft.graph.macOsVppAppAssignedLicense": "#/components/schemas/microsoft.graph.macOsVppAppAssignedLicense",
            "#microsoft.graph.mailAssessmentRequest": "#/components/schemas/microsoft.graph.mailAssessmentRequest",
            "#microsoft.graph.mailFolder": "#/components/schemas/microsoft.graph.mailFolder",
            "#microsoft.graph.mailSearchFolder": "#/components/schemas/microsoft.graph.mailSearchFolder",
            "#microsoft.graph.malwareStateForWindowsDevice": "#/components/schemas/microsoft.graph.malwareStateForWindowsDevice",
            "#microsoft.graph.managedAllDeviceCertificateState": "#/components/schemas/microsoft.graph.managedAllDeviceCertificateState",
            "#microsoft.graph.managedAndroidLobApp": "#/components/schemas/microsoft.graph.managedAndroidLobApp",
            "#microsoft.graph.managedAndroidStoreApp": "#/components/schemas/microsoft.graph.managedAndroidStoreApp",
            "#microsoft.graph.managedApp": "#/components/schemas/microsoft.graph.managedApp",
            "#microsoft.graph.managedAppConfiguration": "#/components/schemas/microsoft.graph.managedAppConfiguration",
            "#microsoft.graph.managedAppOperation": "#/components/schemas/microsoft.graph.managedAppOperation",
            "#microsoft.graph.managedAppPolicy": "#/components/schemas/microsoft.graph.managedAppPolicy",
            "#microsoft.graph.managedAppPolicyDeploymentSummary": "#/components/schemas/microsoft.graph.managedAppPolicyDeploymentSummary",
            "#microsoft.graph.managedAppProtection": "#/components/schemas/microsoft.graph.managedAppProtection",
            "#microsoft.graph.managedAppProtectionPolicySetItem": "#/components/schemas/microsoft.graph.managedAppProtectionPolicySetItem",
            "#microsoft.graph.managedAppRegistration": "#/components/schemas/microsoft.graph.managedAppRegistration",
            "#microsoft.graph.managedAppStatus": "#/components/schemas/microsoft.graph.managedAppStatus",
            "#microsoft.graph.managedAppStatusRaw": "#/components/schemas/microsoft.graph.managedAppStatusRaw",
            "#microsoft.graph.managedDevice": "#/components/schemas/microsoft.graph.managedDevice",
            "#microsoft.graph.managedDeviceCertificateState": "#/components/schemas/microsoft.graph.managedDeviceCertificateState",
            "#microsoft.graph.managedDeviceEncryptionState": "#/components/schemas/microsoft.graph.managedDeviceEncryptionState",
            "#microsoft.graph.managedDeviceMobileAppConfiguration": "#/components/schemas/microsoft.graph.managedDeviceMobileAppConfiguration",
            "#microsoft.graph.managedDeviceMobileAppConfigurationAssignment": "#/components/schemas/microsoft.graph.managedDeviceMobileAppConfigurationAssignment",
            "#microsoft.graph.managedDeviceMobileAppConfigurationDeviceStatus": "#/components/schemas/microsoft.graph.managedDeviceMobileAppConfigurationDeviceStatus",
            "#microsoft.graph.managedDeviceMobileAppConfigurationDeviceSummary": "#/components/schemas/microsoft.graph.managedDeviceMobileAppConfigurationDeviceSummary",
            "#microsoft.graph.managedDeviceMobileAppConfigurationPolicySetItem": "#/components/schemas/microsoft.graph.managedDeviceMobileAppConfigurationPolicySetItem",
            "#microsoft.graph.managedDeviceMobileAppConfigurationState": "#/components/schemas/microsoft.graph.managedDeviceMobileAppConfigurationState",
            "#microsoft.graph.managedDeviceMobileAppConfigurationUserStatus": "#/components/schemas/microsoft.graph.managedDeviceMobileAppConfigurationUserStatus",
            "#microsoft.graph.managedDeviceMobileAppConfigurationUserSummary": "#/components/schemas/microsoft.graph.managedDeviceMobileAppConfigurationUserSummary",
            "#microsoft.graph.managedDeviceOverview": "#/components/schemas/microsoft.graph.managedDeviceOverview",
            "#microsoft.graph.managedEBook": "#/components/schemas/microsoft.graph.managedEBook",
            "#microsoft.graph.managedEBookAssignment": "#/components/schemas/microsoft.graph.managedEBookAssignment",
            "#microsoft.graph.managedEBookCategory": "#/components/schemas/microsoft.graph.managedEBookCategory",
            "#microsoft.graph.managedIOSLobApp": "#/components/schemas/microsoft.graph.managedIOSLobApp",
            "#microsoft.graph.managedIOSStoreApp": "#/components/schemas/microsoft.graph.managedIOSStoreApp",
            "#microsoft.graph.managedMobileApp": "#/components/schemas/microsoft.graph.managedMobileApp",
            "#microsoft.graph.managedMobileLobApp": "#/components/schemas/microsoft.graph.managedMobileLobApp",
            "#microsoft.graph.managedTenants.aggregatedPolicyCompliance": "#/components/schemas/microsoft.graph.managedTenants.aggregatedPolicyCompliance",
            "#microsoft.graph.managedTenants.auditEvent": "#/components/schemas/microsoft.graph.managedTenants.auditEvent",
            "#microsoft.graph.managedTenants.cloudPcConnection": "#/components/schemas/microsoft.graph.managedTenants.cloudPcConnection",
            "#microsoft.graph.managedTenants.cloudPcDevice": "#/components/schemas/microsoft.graph.managedTenants.cloudPcDevice",
            "#microsoft.graph.managedTenants.cloudPcOverview": "#/components/schemas/microsoft.graph.managedTenants.cloudPcOverview",
            "#microsoft.graph.managedTenants.conditionalAccessPolicyCoverage": "#/components/schemas/microsoft.graph.managedTenants.conditionalAccessPolicyCoverage",
            "#microsoft.graph.managedTenants.credentialUserRegistrationsSummary": "#/components/schemas/microsoft.graph.managedTenants.credentialUserRegistrationsSummary",
            "#microsoft.graph.managedTenants.deviceCompliancePolicySettingStateSummary": "#/components/schemas/microsoft.graph.managedTenants.deviceCompliancePolicySettingStateSummary",
            "#microsoft.graph.managedTenants.managedDeviceCompliance": "#/components/schemas/microsoft.graph.managedTenants.managedDeviceCompliance",
            "#microsoft.graph.managedTenants.managedDeviceComplianceTrend": "#/components/schemas/microsoft.graph.managedTenants.managedDeviceComplianceTrend",
            "#microsoft.graph.managedTenants.managedTenant": "#/components/schemas/microsoft.graph.managedTenants.managedTenant",
            "#microsoft.graph.managedTenants.managedTenantAlert": "#/components/schemas/microsoft.graph.managedTenants.managedTenantAlert",
            "#microsoft.graph.managedTenants.managedTenantAlertLog": "#/components/schemas/microsoft.graph.managedTenants.managedTenantAlertLog",
            "#microsoft.graph.managedTenants.managedTenantAlertRule": "#/components/schemas/microsoft.graph.managedTenants.managedTenantAlertRule",
            "#microsoft.graph.managedTenants.managedTenantAlertRuleDefinition": "#/components/schemas/microsoft.graph.managedTenants.managedTenantAlertRuleDefinition",
            "#microsoft.graph.managedTenants.managedTenantApiNotification": "#/components/schemas/microsoft.graph.managedTenants.managedTenantApiNotification",
            "#microsoft.graph.managedTenants.managedTenantEmailNotification": "#/components/schemas/microsoft.graph.managedTenants.managedTenantEmailNotification",
            "#microsoft.graph.managedTenants.managedTenantTicketingEndpoint": "#/components/schemas/microsoft.graph.managedTenants.managedTenantTicketingEndpoint",
            "#microsoft.graph.managedTenants.managementAction": "#/components/schemas/microsoft.graph.managedTenants.managementAction",
            "#microsoft.graph.managedTenants.managementActionTenantDeploymentStatus": "#/components/schemas/microsoft.graph.managedTenants.managementActionTenantDeploymentStatus",
            "#microsoft.graph.managedTenants.managementIntent": "#/components/schemas/microsoft.graph.managedTenants.managementIntent",
            "#microsoft.graph.managedTenants.managementTemplate": "#/components/schemas/microsoft.graph.managedTenants.managementTemplate",
            "#microsoft.graph.managedTenants.managementTemplateCollection": "#/components/schemas/microsoft.graph.managedTenants.managementTemplateCollection",
            "#microsoft.graph.managedTenants.managementTemplateCollectionTenantSummary": "#/components/schemas/microsoft.graph.managedTenants.managementTemplateCollectionTenantSummary",
            "#microsoft.graph.managedTenants.managementTemplateStep": "#/components/schemas/microsoft.graph.managedTenants.managementTemplateStep",
            "#microsoft.graph.managedTenants.managementTemplateStepDeployment": "#/components/schemas/microsoft.graph.managedTenants.managementTemplateStepDeployment",
            "#microsoft.graph.managedTenants.managementTemplateStepTenantSummary": "#/components/schemas/microsoft.graph.managedTenants.managementTemplateStepTenantSummary",
            "#microsoft.graph.managedTenants.managementTemplateStepVersion": "#/components/schemas/microsoft.graph.managedTenants.managementTemplateStepVersion",
            "#microsoft.graph.managedTenants.tenant": "#/components/schemas/microsoft.graph.managedTenants.tenant",
            "#microsoft.graph.managedTenants.tenantCustomizedInformation": "#/components/schemas/microsoft.graph.managedTenants.tenantCustomizedInformation",
            "#microsoft.graph.managedTenants.tenantDetailedInformation": "#/components/schemas/microsoft.graph.managedTenants.tenantDetailedInformation",
            "#microsoft.graph.managedTenants.tenantGroup": "#/components/schemas/microsoft.graph.managedTenants.tenantGroup",
            "#microsoft.graph.managedTenants.tenantTag": "#/components/schemas/microsoft.graph.managedTenants.tenantTag",
            "#microsoft.graph.managedTenants.windowsDeviceMalwareState": "#/components/schemas/microsoft.graph.managedTenants.windowsDeviceMalwareState",
            "#microsoft.graph.managedTenants.windowsProtectionState": "#/components/schemas/microsoft.graph.managedTenants.windowsProtectionState",
            "#microsoft.graph.mdmWindowsInformationProtectionPolicy": "#/components/schemas/microsoft.graph.mdmWindowsInformationProtectionPolicy",
            "#microsoft.graph.mdmWindowsInformationProtectionPolicyPolicySetItem": "#/components/schemas/microsoft.graph.mdmWindowsInformationProtectionPolicyPolicySetItem",
            "#microsoft.graph.meetingActivityStatistics": "#/components/schemas/microsoft.graph.meetingActivityStatistics",
            "#microsoft.graph.meetingAttendanceReport": "#/components/schemas/microsoft.graph.meetingAttendanceReport",
            "#microsoft.graph.meetingRegistrant": "#/components/schemas/microsoft.graph.meetingRegistrant",
            "#microsoft.graph.meetingRegistrantBase": "#/components/schemas/microsoft.graph.meetingRegistrantBase",
            "#microsoft.graph.meetingRegistration": "#/components/schemas/microsoft.graph.meetingRegistration",
            "#microsoft.graph.meetingRegistrationBase": "#/components/schemas/microsoft.graph.meetingRegistrationBase",
            "#microsoft.graph.meetingRegistrationQuestion": "#/components/schemas/microsoft.graph.meetingRegistrationQuestion",
            "#microsoft.graph.membershipOutlierInsight": "#/components/schemas/microsoft.graph.membershipOutlierInsight",
            "#microsoft.graph.mention": "#/components/schemas/microsoft.graph.mention",
            "#microsoft.graph.message": "#/components/schemas/microsoft.graph.message",
            "#microsoft.graph.messageEvent": "#/components/schemas/microsoft.graph.messageEvent",
            "#microsoft.graph.messageRecipient": "#/components/schemas/microsoft.graph.messageRecipient",
            "#microsoft.graph.messageRule": "#/components/schemas/microsoft.graph.messageRule",
            "#microsoft.graph.messageTrace": "#/components/schemas/microsoft.graph.messageTrace",
            "#microsoft.graph.microsoftAccountUserConversationMember": "#/components/schemas/microsoft.graph.microsoftAccountUserConversationMember",
            "#microsoft.graph.microsoftApplicationDataAccessSettings": "#/components/schemas/microsoft.graph.microsoftApplicationDataAccessSettings",
            "#microsoft.graph.microsoftAuthenticatorAuthenticationMethod": "#/components/schemas/microsoft.graph.microsoftAuthenticatorAuthenticationMethod",
            "#microsoft.graph.microsoftAuthenticatorAuthenticationMethodConfiguration": "#/components/schemas/microsoft.graph.microsoftAuthenticatorAuthenticationMethodConfiguration",
            "#microsoft.graph.microsoftAuthenticatorAuthenticationMethodTarget": "#/components/schemas/microsoft.graph.microsoftAuthenticatorAuthenticationMethodTarget",
            "#microsoft.graph.microsoftStoreForBusinessApp": "#/components/schemas/microsoft.graph.microsoftStoreForBusinessApp",
            "#microsoft.graph.microsoftStoreForBusinessContainedApp": "#/components/schemas/microsoft.graph.microsoftStoreForBusinessContainedApp",
            "#microsoft.graph.microsoftTunnelConfiguration": "#/components/schemas/microsoft.graph.microsoftTunnelConfiguration",
            "#microsoft.graph.microsoftTunnelHealthThreshold": "#/components/schemas/microsoft.graph.microsoftTunnelHealthThreshold",
            "#microsoft.graph.microsoftTunnelServer": "#/components/schemas/microsoft.graph.microsoftTunnelServer",
            "#microsoft.graph.microsoftTunnelServerLogCollectionResponse": "#/components/schemas/microsoft.graph.microsoftTunnelServerLogCollectionResponse",
            "#microsoft.graph.microsoftTunnelSite": "#/components/schemas/microsoft.graph.microsoftTunnelSite",
            "#microsoft.graph.mobileApp": "#/components/schemas/microsoft.graph.mobileApp",
            "#microsoft.graph.mobileAppAssignment": "#/components/schemas/microsoft.graph.mobileAppAssignment",
            "#microsoft.graph.mobileAppCategory": "#/components/schemas/microsoft.graph.mobileAppCategory",
            "#microsoft.graph.mobileAppContent": "#/components/schemas/microsoft.graph.mobileAppContent",
            "#microsoft.graph.mobileAppContentFile": "#/components/schemas/microsoft.graph.mobileAppContentFile",
            "#microsoft.graph.mobileAppDependency": "#/components/schemas/microsoft.graph.mobileAppDependency",
            "#microsoft.graph.mobileAppInstallStatus": "#/components/schemas/microsoft.graph.mobileAppInstallStatus",
            "#microsoft.graph.mobileAppInstallSummary": "#/components/schemas/microsoft.graph.mobileAppInstallSummary",
            "#microsoft.graph.mobileAppIntentAndState": "#/components/schemas/microsoft.graph.mobileAppIntentAndState",
            "#microsoft.graph.mobileAppPolicySetItem": "#/components/schemas/microsoft.graph.mobileAppPolicySetItem",
            "#microsoft.graph.mobileAppProvisioningConfigGroupAssignment": "#/components/schemas/microsoft.graph.mobileAppProvisioningConfigGroupAssignment",
            "#microsoft.graph.mobileAppRelationship": "#/components/schemas/microsoft.graph.mobileAppRelationship",
            "#microsoft.graph.mobileAppSupersedence": "#/components/schemas/microsoft.graph.mobileAppSupersedence",
            "#microsoft.graph.mobileAppTroubleshootingEvent": "#/components/schemas/microsoft.graph.mobileAppTroubleshootingEvent",
            "#microsoft.graph.mobileContainedApp": "#/components/schemas/microsoft.graph.mobileContainedApp",
            "#microsoft.graph.mobileLobApp": "#/components/schemas/microsoft.graph.mobileLobApp",
            "#microsoft.graph.mobileThreatDefenseConnector": "#/components/schemas/microsoft.graph.mobileThreatDefenseConnector",
            "#microsoft.graph.mobilityManagementPolicy": "#/components/schemas/microsoft.graph.mobilityManagementPolicy",
            "#microsoft.graph.multiValueLegacyExtendedProperty": "#/components/schemas/microsoft.graph.multiValueLegacyExtendedProperty",
            "#microsoft.graph.muteParticipantOperation": "#/components/schemas/microsoft.graph.muteParticipantOperation",
            "#microsoft.graph.muteParticipantsOperation": "#/components/schemas/microsoft.graph.muteParticipantsOperation",
            "#microsoft.graph.namedLocation": "#/components/schemas/microsoft.graph.namedLocation",
            "#microsoft.graph.ndesConnector": "#/components/schemas/microsoft.graph.ndesConnector",
            "#microsoft.graph.note": "#/components/schemas/microsoft.graph.note",
            "#microsoft.graph.notebook": "#/components/schemas/microsoft.graph.notebook",
            "#microsoft.graph.notification": "#/components/schemas/microsoft.graph.notification",
            "#microsoft.graph.notificationMessageTemplate": "#/components/schemas/microsoft.graph.notificationMessageTemplate",
            "#microsoft.graph.oAuth2PermissionGrant": "#/components/schemas/microsoft.graph.oAuth2PermissionGrant",
            "#microsoft.graph.oemWarrantyInformationOnboarding": "#/components/schemas/microsoft.graph.oemWarrantyInformationOnboarding",
            "#microsoft.graph.offerShiftRequest": "#/components/schemas/microsoft.graph.offerShiftRequest",
            "#microsoft.graph.office365ActiveUserCounts": "#/components/schemas/microsoft.graph.office365ActiveUserCounts",
            "#microsoft.graph.office365ActiveUserDetail": "#/components/schemas/microsoft.graph.office365ActiveUserDetail",
            "#microsoft.graph.office365GroupsActivityCounts": "#/components/schemas/microsoft.graph.office365GroupsActivityCounts",
            "#microsoft.graph.office365GroupsActivityDetail": "#/components/schemas/microsoft.graph.office365GroupsActivityDetail",
            "#microsoft.graph.office365GroupsActivityFileCounts": "#/components/schemas/microsoft.graph.office365GroupsActivityFileCounts",
            "#microsoft.graph.office365GroupsActivityGroupCounts": "#/components/schemas/microsoft.graph.office365GroupsActivityGroupCounts",
            "#microsoft.graph.office365GroupsActivityStorage": "#/components/schemas/microsoft.graph.office365GroupsActivityStorage",
            "#microsoft.graph.office365ServicesUserCounts": "#/components/schemas/microsoft.graph.office365ServicesUserCounts",
            "#microsoft.graph.officeClientConfiguration": "#/components/schemas/microsoft.graph.officeClientConfiguration",
            "#microsoft.graph.officeClientConfigurationAssignment": "#/components/schemas/microsoft.graph.officeClientConfigurationAssignment",
            "#microsoft.graph.officeGraphInsights": "#/components/schemas/microsoft.graph.officeGraphInsights",
            "#microsoft.graph.officeSuiteApp": "#/components/schemas/microsoft.graph.officeSuiteApp",
            "#microsoft.graph.onPremisesAgent": "#/components/schemas/microsoft.graph.onPremisesAgent",
            "#microsoft.graph.onPremisesAgentGroup": "#/components/schemas/microsoft.graph.onPremisesAgentGroup",
            "#microsoft.graph.onPremisesConditionalAccessSettings": "#/components/schemas/microsoft.graph.onPremisesConditionalAccessSettings",
            "#microsoft.graph.onPremisesDirectorySynchronization": "#/components/schemas/microsoft.graph.onPremisesDirectorySynchronization",
            "#microsoft.graph.onPremisesPublishingProfile": "#/components/schemas/microsoft.graph.onPremisesPublishingProfile",
            "#microsoft.graph.onTokenIssuanceStartCustomExtension": "#/components/schemas/microsoft.graph.onTokenIssuanceStartCustomExtension",
            "#microsoft.graph.onTokenIssuanceStartListener": "#/components/schemas/microsoft.graph.onTokenIssuanceStartListener",
            "#microsoft.graph.onenote": "#/components/schemas/microsoft.graph.onenote",
            "#microsoft.graph.onenoteEntityBaseModel": "#/components/schemas/microsoft.graph.onenoteEntityBaseModel",
            "#microsoft.graph.onenoteEntityHierarchyModel": "#/components/schemas/microsoft.graph.onenoteEntityHierarchyModel",
            "#microsoft.graph.onenoteEntitySchemaObjectModel": "#/components/schemas/microsoft.graph.onenoteEntitySchemaObjectModel",
            "#microsoft.graph.onenoteOperation": "#/components/schemas/microsoft.graph.onenoteOperation",
            "#microsoft.graph.onenotePage": "#/components/schemas/microsoft.graph.onenotePage",
            "#microsoft.graph.onenoteResource": "#/components/schemas/microsoft.graph.onenoteResource",
            "#microsoft.graph.onenoteSection": "#/components/schemas/microsoft.graph.onenoteSection",
            "#microsoft.graph.onlineMeeting": "#/components/schemas/microsoft.graph.onlineMeeting",
            "#microsoft.graph.openIdConnectIdentityProvider": "#/components/schemas/microsoft.graph.openIdConnectIdentityProvider",
            "#microsoft.graph.openIdConnectProvider": "#/components/schemas/microsoft.graph.openIdConnectProvider",
            "#microsoft.graph.openShift": "#/components/schemas/microsoft.graph.openShift",
            "#microsoft.graph.openShiftChangeRequest": "#/components/schemas/microsoft.graph.openShiftChangeRequest",
            "#microsoft.graph.openTypeExtension": "#/components/schemas/microsoft.graph.openTypeExtension",
            "#microsoft.graph.operation": "#/components/schemas/microsoft.graph.operation",
            "#microsoft.graph.orgContact": "#/components/schemas/microsoft.graph.orgContact",
            "#microsoft.graph.organization": "#/components/schemas/microsoft.graph.organization",
            "#microsoft.graph.organizationSettings": "#/components/schemas/microsoft.graph.organizationSettings",
            "#microsoft.graph.organizationalBranding": "#/components/schemas/microsoft.graph.organizationalBranding",
            "#microsoft.graph.organizationalBrandingLocalization": "#/components/schemas/microsoft.graph.organizationalBrandingLocalization",
            "#microsoft.graph.organizationalBrandingProperties": "#/components/schemas/microsoft.graph.organizationalBrandingProperties",
            "#microsoft.graph.outlookCategory": "#/components/schemas/microsoft.graph.outlookCategory",
            "#microsoft.graph.outlookItem": "#/components/schemas/microsoft.graph.outlookItem",
            "#microsoft.graph.outlookTask": "#/components/schemas/microsoft.graph.outlookTask",
            "#microsoft.graph.outlookTaskFolder": "#/components/schemas/microsoft.graph.outlookTaskFolder",
            "#microsoft.graph.outlookTaskGroup": "#/components/schemas/microsoft.graph.outlookTaskGroup",
            "#microsoft.graph.outlookUser": "#/components/schemas/microsoft.graph.outlookUser",
            "#microsoft.graph.participant": "#/components/schemas/microsoft.graph.participant",
            "#microsoft.graph.participantJoiningNotification": "#/components/schemas/microsoft.graph.participantJoiningNotification",
            "#microsoft.graph.participantLeftNotification": "#/components/schemas/microsoft.graph.participantLeftNotification",
            "#microsoft.graph.passwordAuthenticationMethod": "#/components/schemas/microsoft.graph.passwordAuthenticationMethod",
            "#microsoft.graph.passwordlessMicrosoftAuthenticatorAuthenticationMethod": "#/components/schemas/microsoft.graph.passwordlessMicrosoftAuthenticatorAuthenticationMethod",
            "#microsoft.graph.payload": "#/components/schemas/microsoft.graph.payload",
            "#microsoft.graph.payloadCompatibleAssignmentFilter": "#/components/schemas/microsoft.graph.payloadCompatibleAssignmentFilter",
            "#microsoft.graph.payloadResponse": "#/components/schemas/microsoft.graph.payloadResponse",
            "#microsoft.graph.paymentMethod": "#/components/schemas/microsoft.graph.paymentMethod",
            "#microsoft.graph.paymentTerm": "#/components/schemas/microsoft.graph.paymentTerm",
            "#microsoft.graph.permission": "#/components/schemas/microsoft.graph.permission",
            "#microsoft.graph.permissionGrantConditionSet": "#/components/schemas/microsoft.graph.permissionGrantConditionSet",
            "#microsoft.graph.permissionGrantPolicy": "#/components/schemas/microsoft.graph.permissionGrantPolicy",
            "#microsoft.graph.person": "#/components/schemas/microsoft.graph.person",
            "#microsoft.graph.personAnnotation": "#/components/schemas/microsoft.graph.personAnnotation",
            "#microsoft.graph.personAnnualEvent": "#/components/schemas/microsoft.graph.personAnnualEvent",
            "#microsoft.graph.personAward": "#/components/schemas/microsoft.graph.personAward",
            "#microsoft.graph.personCertification": "#/components/schemas/microsoft.graph.personCertification",
            "#microsoft.graph.personExtension": "#/components/schemas/microsoft.graph.personExtension",
            "#microsoft.graph.personInterest": "#/components/schemas/microsoft.graph.personInterest",
            "#microsoft.graph.personName": "#/components/schemas/microsoft.graph.personName",
            "#microsoft.graph.personResponsibility": "#/components/schemas/microsoft.graph.personResponsibility",
            "#microsoft.graph.personWebsite": "#/components/schemas/microsoft.graph.personWebsite",
            "#microsoft.graph.phoneAuthenticationMethod": "#/components/schemas/microsoft.graph.phoneAuthenticationMethod",
            "#microsoft.graph.picture": "#/components/schemas/microsoft.graph.picture",
            "#microsoft.graph.pinnedChatMessageInfo": "#/components/schemas/microsoft.graph.pinnedChatMessageInfo",
            "#microsoft.graph.place": "#/components/schemas/microsoft.graph.place",
            "#microsoft.graph.planner": "#/components/schemas/microsoft.graph.planner",
            "#microsoft.graph.plannerAssignedToTaskBoardTaskFormat": "#/components/schemas/microsoft.graph.plannerAssignedToTaskBoardTaskFormat",
            "#microsoft.graph.plannerBucket": "#/components/schemas/microsoft.graph.plannerBucket",
            "#microsoft.graph.plannerBucketTaskBoardTaskFormat": "#/components/schemas/microsoft.graph.plannerBucketTaskBoardTaskFormat",
            "#microsoft.graph.plannerDelta": "#/components/schemas/microsoft.graph.plannerDelta",
            "#microsoft.graph.plannerGroup": "#/components/schemas/microsoft.graph.plannerGroup",
            "#microsoft.graph.plannerPlan": "#/components/schemas/microsoft.graph.plannerPlan",
            "#microsoft.graph.plannerPlanConfiguration": "#/components/schemas/microsoft.graph.plannerPlanConfiguration",
            "#microsoft.graph.plannerPlanConfigurationLocalization": "#/components/schemas/microsoft.graph.plannerPlanConfigurationLocalization",
            "#microsoft.graph.plannerPlanDetails": "#/components/schemas/microsoft.graph.plannerPlanDetails",
            "#microsoft.graph.plannerProgressTaskBoardTaskFormat": "#/components/schemas/microsoft.graph.plannerProgressTaskBoardTaskFormat",
            "#microsoft.graph.plannerRoster": "#/components/schemas/microsoft.graph.plannerRoster",
            "#microsoft.graph.plannerRosterMember": "#/components/schemas/microsoft.graph.plannerRosterMember",
            "#microsoft.graph.plannerTask": "#/components/schemas/microsoft.graph.plannerTask",
            "#microsoft.graph.plannerTaskConfiguration": "#/components/schemas/microsoft.graph.plannerTaskConfiguration",
            "#microsoft.graph.plannerTaskDetails": "#/components/schemas/microsoft.graph.plannerTaskDetails",
            "#microsoft.graph.plannerUser": "#/components/schemas/microsoft.graph.plannerUser",
            "#microsoft.graph.playPromptOperation": "#/components/schemas/microsoft.graph.playPromptOperation",
            "#microsoft.graph.policyBase": "#/components/schemas/microsoft.graph.policyBase",
            "#microsoft.graph.policySet": "#/components/schemas/microsoft.graph.policySet",
            "#microsoft.graph.policySetAssignment": "#/components/schemas/microsoft.graph.policySetAssignment",
            "#microsoft.graph.policySetItem": "#/components/schemas/microsoft.graph.policySetItem",
            "#microsoft.graph.post": "#/components/schemas/microsoft.graph.post",
            "#microsoft.graph.presence": "#/components/schemas/microsoft.graph.presence",
            "#microsoft.graph.presentation": "#/components/schemas/microsoft.graph.presentation",
            "#microsoft.graph.printConnector": "#/components/schemas/microsoft.graph.printConnector",
            "#microsoft.graph.printDocument": "#/components/schemas/microsoft.graph.printDocument",
            "#microsoft.graph.printJob": "#/components/schemas/microsoft.graph.printJob",
            "#microsoft.graph.printOperation": "#/components/schemas/microsoft.graph.printOperation",
            "#microsoft.graph.printService": "#/components/schemas/microsoft.graph.printService",
            "#microsoft.graph.printServiceEndpoint": "#/components/schemas/microsoft.graph.printServiceEndpoint",
            "#microsoft.graph.printTask": "#/components/schemas/microsoft.graph.printTask",
            "#microsoft.graph.printTaskDefinition": "#/components/schemas/microsoft.graph.printTaskDefinition",
            "#microsoft.graph.printTaskTrigger": "#/components/schemas/microsoft.graph.printTaskTrigger",
            "#microsoft.graph.printUsage": "#/components/schemas/microsoft.graph.printUsage",
            "#microsoft.graph.printUsageByPrinter": "#/components/schemas/microsoft.graph.printUsageByPrinter",
            "#microsoft.graph.printUsageByUser": "#/components/schemas/microsoft.graph.printUsageByUser",
            "#microsoft.graph.printer": "#/components/schemas/microsoft.graph.printer",
            "#microsoft.graph.printerBase": "#/components/schemas/microsoft.graph.printerBase",
            "#microsoft.graph.printerCreateOperation": "#/components/schemas/microsoft.graph.printerCreateOperation",
            "#microsoft.graph.printerShare": "#/components/schemas/microsoft.graph.printerShare",
            "#microsoft.graph.privilegedAccess": "#/components/schemas/microsoft.graph.privilegedAccess",
            "#microsoft.graph.privilegedAccessGroup": "#/components/schemas/microsoft.graph.privilegedAccessGroup",
            "#microsoft.graph.privilegedAccessGroupAssignmentSchedule": "#/components/schemas/microsoft.graph.privilegedAccessGroupAssignmentSchedule",
            "#microsoft.graph.privilegedAccessGroupAssignmentScheduleInstance": "#/components/schemas/microsoft.graph.privilegedAccessGroupAssignmentScheduleInstance",
            "#microsoft.graph.privilegedAccessGroupAssignmentScheduleRequest": "#/components/schemas/microsoft.graph.privilegedAccessGroupAssignmentScheduleRequest",
            "#microsoft.graph.privilegedAccessGroupEligibilitySchedule": "#/components/schemas/microsoft.graph.privilegedAccessGroupEligibilitySchedule",
            "#microsoft.graph.privilegedAccessGroupEligibilityScheduleInstance": "#/components/schemas/microsoft.graph.privilegedAccessGroupEligibilityScheduleInstance",
            "#microsoft.graph.privilegedAccessGroupEligibilityScheduleRequest": "#/components/schemas/microsoft.graph.privilegedAccessGroupEligibilityScheduleRequest",
            "#microsoft.graph.privilegedAccessRoot": "#/components/schemas/microsoft.graph.privilegedAccessRoot",
            "#microsoft.graph.privilegedAccessSchedule": "#/components/schemas/microsoft.graph.privilegedAccessSchedule",
            "#microsoft.graph.privilegedAccessScheduleInstance": "#/components/schemas/microsoft.graph.privilegedAccessScheduleInstance",
            "#microsoft.graph.privilegedAccessScheduleRequest": "#/components/schemas/microsoft.graph.privilegedAccessScheduleRequest",
            "#microsoft.graph.privilegedApproval": "#/components/schemas/microsoft.graph.privilegedApproval",
            "#microsoft.graph.privilegedOperationEvent": "#/components/schemas/microsoft.graph.privilegedOperationEvent",
            "#microsoft.graph.privilegedRole": "#/components/schemas/microsoft.graph.privilegedRole",
            "#microsoft.graph.privilegedRoleAssignment": "#/components/schemas/microsoft.graph.privilegedRoleAssignment",
            "#microsoft.graph.privilegedRoleAssignmentRequest": "#/components/schemas/microsoft.graph.privilegedRoleAssignmentRequest",
            "#microsoft.graph.privilegedRoleSettings": "#/components/schemas/microsoft.graph.privilegedRoleSettings",
            "#microsoft.graph.privilegedRoleSummary": "#/components/schemas/microsoft.graph.privilegedRoleSummary",
            "#microsoft.graph.privilegedSignupStatus": "#/components/schemas/microsoft.graph.privilegedSignupStatus",
            "#microsoft.graph.profile": "#/components/schemas/microsoft.graph.profile",
            "#microsoft.graph.profileCardProperty": "#/components/schemas/microsoft.graph.profileCardProperty",
            "#microsoft.graph.profilePhoto": "#/components/schemas/microsoft.graph.profilePhoto",
            "#microsoft.graph.program": "#/components/schemas/microsoft.graph.program",
            "#microsoft.graph.programControl": "#/components/schemas/microsoft.graph.programControl",
            "#microsoft.graph.programControlType": "#/components/schemas/microsoft.graph.programControlType",
            "#microsoft.graph.projectParticipation": "#/components/schemas/microsoft.graph.projectParticipation",
            "#microsoft.graph.providerTenantSetting": "#/components/schemas/microsoft.graph.providerTenantSetting",
            "#microsoft.graph.provisioningObjectSummary": "#/components/schemas/microsoft.graph.provisioningObjectSummary",
            "#microsoft.graph.publishedResource": "#/components/schemas/microsoft.graph.publishedResource",
            "#microsoft.graph.purchaseInvoice": "#/components/schemas/microsoft.graph.purchaseInvoice",
            "#microsoft.graph.purchaseInvoiceLine": "#/components/schemas/microsoft.graph.purchaseInvoiceLine",
            "#microsoft.graph.rbacApplication": "#/components/schemas/microsoft.graph.rbacApplication",
            "#microsoft.graph.rbacApplicationMultiple": "#/components/schemas/microsoft.graph.rbacApplicationMultiple",
            "#microsoft.graph.recommendation": "#/components/schemas/microsoft.graph.recommendation",
            "#microsoft.graph.recommendationBase": "#/components/schemas/microsoft.graph.recommendationBase",
            "#microsoft.graph.recordOperation": "#/components/schemas/microsoft.graph.recordOperation",
            "#microsoft.graph.referenceAttachment": "#/components/schemas/microsoft.graph.referenceAttachment",
            "#microsoft.graph.regionalAndLanguageSettings": "#/components/schemas/microsoft.graph.regionalAndLanguageSettings",
            "#microsoft.graph.relyingPartyDetailedSummary": "#/components/schemas/microsoft.graph.relyingPartyDetailedSummary",
            "#microsoft.graph.remoteActionAudit": "#/components/schemas/microsoft.graph.remoteActionAudit",
            "#microsoft.graph.remoteAssistancePartner": "#/components/schemas/microsoft.graph.remoteAssistancePartner",
            "#microsoft.graph.remoteAssistanceSettings": "#/components/schemas/microsoft.graph.remoteAssistanceSettings",
            "#microsoft.graph.reportRoot": "#/components/schemas/microsoft.graph.reportRoot",
            "#microsoft.graph.request": "#/components/schemas/microsoft.graph.request",
            "#microsoft.graph.resourceOperation": "#/components/schemas/microsoft.graph.resourceOperation",
            "#microsoft.graph.resourceSpecificPermissionGrant": "#/components/schemas/microsoft.graph.resourceSpecificPermissionGrant",
            "#microsoft.graph.restrictedAppsViolation": "#/components/schemas/microsoft.graph.restrictedAppsViolation",
            "#microsoft.graph.richLongRunningOperation": "#/components/schemas/microsoft.graph.richLongRunningOperation",
            "#microsoft.graph.riskDetection": "#/components/schemas/microsoft.graph.riskDetection",
            "#microsoft.graph.riskyServicePrincipal": "#/components/schemas/microsoft.graph.riskyServicePrincipal",
            "#microsoft.graph.riskyServicePrincipalHistoryItem": "#/components/schemas/microsoft.graph.riskyServicePrincipalHistoryItem",
            "#microsoft.graph.riskyUser": "#/components/schemas/microsoft.graph.riskyUser",
            "#microsoft.graph.riskyUserHistoryItem": "#/components/schemas/microsoft.graph.riskyUserHistoryItem",
            "#microsoft.graph.roleAssignment": "#/components/schemas/microsoft.graph.roleAssignment",
            "#microsoft.graph.roleDefinition": "#/components/schemas/microsoft.graph.roleDefinition",
            "#microsoft.graph.roleScopeTag": "#/components/schemas/microsoft.graph.roleScopeTag",
            "#microsoft.graph.roleScopeTagAutoAssignment": "#/components/schemas/microsoft.graph.roleScopeTagAutoAssignment",
            "#microsoft.graph.room": "#/components/schemas/microsoft.graph.room",
            "#microsoft.graph.roomList": "#/components/schemas/microsoft.graph.roomList",
            "#microsoft.graph.salesCreditMemo": "#/components/schemas/microsoft.graph.salesCreditMemo",
            "#microsoft.graph.salesCreditMemoLine": "#/components/schemas/microsoft.graph.salesCreditMemoLine",
            "#microsoft.graph.salesInvoice": "#/components/schemas/microsoft.graph.salesInvoice",
            "#microsoft.graph.salesInvoiceLine": "#/components/schemas/microsoft.graph.salesInvoiceLine",
            "#microsoft.graph.salesOrder": "#/components/schemas/microsoft.graph.salesOrder",
            "#microsoft.graph.salesOrderLine": "#/components/schemas/microsoft.graph.salesOrderLine",
            "#microsoft.graph.salesQuote": "#/components/schemas/microsoft.graph.salesQuote",
            "#microsoft.graph.salesQuoteLine": "#/components/schemas/microsoft.graph.salesQuoteLine",
            "#microsoft.graph.samlOrWsFedExternalDomainFederation": "#/components/schemas/microsoft.graph.samlOrWsFedExternalDomainFederation",
            "#microsoft.graph.samlOrWsFedProvider": "#/components/schemas/microsoft.graph.samlOrWsFedProvider",
            "#microsoft.graph.schedule": "#/components/schemas/microsoft.graph.schedule",
            "#microsoft.graph.scheduleChangeRequest": "#/components/schemas/microsoft.graph.scheduleChangeRequest",
            "#microsoft.graph.schedulingGroup": "#/components/schemas/microsoft.graph.schedulingGroup",
            "#microsoft.graph.schema": "#/components/schemas/microsoft.graph.schema",
            "#microsoft.graph.schemaExtension": "#/components/schemas/microsoft.graph.schemaExtension",
            "#microsoft.graph.scopedRoleMembership": "#/components/schemas/microsoft.graph.scopedRoleMembership",
            "#microsoft.graph.search.acronym": "#/components/schemas/microsoft.graph.search.acronym",
            "#microsoft.graph.search.bookmark": "#/components/schemas/microsoft.graph.search.bookmark",
            "#microsoft.graph.search.qna": "#/components/schemas/microsoft.graph.search.qna",
            "#microsoft.graph.search.searchAnswer": "#/components/schemas/microsoft.graph.search.searchAnswer",
            "#microsoft.graph.searchEntity": "#/components/schemas/microsoft.graph.searchEntity",
            "#microsoft.graph.sectionGroup": "#/components/schemas/microsoft.graph.sectionGroup",
            "#microsoft.graph.secureScore": "#/components/schemas/microsoft.graph.secureScore",
            "#microsoft.graph.secureScoreControlProfile": "#/components/schemas/microsoft.graph.secureScoreControlProfile",
            "#microsoft.graph.security": "#/components/schemas/microsoft.graph.security",
            "#microsoft.graph.security.alert": "#/components/schemas/microsoft.graph.security.alert",
            "#microsoft.graph.security.case": "#/components/schemas/microsoft.graph.security.case",
            "#microsoft.graph.security.caseOperation": "#/components/schemas/microsoft.graph.security.caseOperation",
            "#microsoft.graph.security.casesRoot": "#/components/schemas/microsoft.graph.security.casesRoot",
            "#microsoft.graph.security.dataSet": "#/components/schemas/microsoft.graph.security.dataSet",
            "#microsoft.graph.security.dataSource": "#/components/schemas/microsoft.graph.security.dataSource",
            "#microsoft.graph.security.dataSourceContainer": "#/components/schemas/microsoft.graph.security.dataSourceContainer",
            "#microsoft.graph.security.dispositionReviewStage": "#/components/schemas/microsoft.graph.security.dispositionReviewStage",
            "#microsoft.graph.security.ediscoveryAddToReviewSetOperation": "#/components/schemas/microsoft.graph.security.ediscoveryAddToReviewSetOperation",
            "#microsoft.graph.security.ediscoveryCase": "#/components/schemas/microsoft.graph.security.ediscoveryCase",
            "#microsoft.graph.security.ediscoveryCaseSettings": "#/components/schemas/microsoft.graph.security.ediscoveryCaseSettings",
            "#microsoft.graph.security.ediscoveryCustodian": "#/components/schemas/microsoft.graph.security.ediscoveryCustodian",
            "#microsoft.graph.security.ediscoveryEstimateOperation": "#/components/schemas/microsoft.graph.security.ediscoveryEstimateOperation",
            "#microsoft.graph.security.ediscoveryExportOperation": "#/components/schemas/microsoft.graph.security.ediscoveryExportOperation",
            "#microsoft.graph.security.ediscoveryFile": "#/components/schemas/microsoft.graph.security.ediscoveryFile",
            "#microsoft.graph.security.ediscoveryHoldOperation": "#/components/schemas/microsoft.graph.security.ediscoveryHoldOperation",
            "#microsoft.graph.security.ediscoveryHoldPolicy": "#/components/schemas/microsoft.graph.security.ediscoveryHoldPolicy",
            "#microsoft.graph.security.ediscoveryIndexOperation": "#/components/schemas/microsoft.graph.security.ediscoveryIndexOperation",
            "#microsoft.graph.security.ediscoveryNoncustodialDataSource": "#/components/schemas/microsoft.graph.security.ediscoveryNoncustodialDataSource",
            "#microsoft.graph.security.ediscoveryPurgeDataOperation": "#/components/schemas/microsoft.graph.security.ediscoveryPurgeDataOperation",
            "#microsoft.graph.security.ediscoveryReviewSet": "#/components/schemas/microsoft.graph.security.ediscoveryReviewSet",
            "#microsoft.graph.security.ediscoveryReviewSetQuery": "#/components/schemas/microsoft.graph.security.ediscoveryReviewSetQuery",
            "#microsoft.graph.security.ediscoveryReviewTag": "#/components/schemas/microsoft.graph.security.ediscoveryReviewTag",
            "#microsoft.graph.security.ediscoverySearch": "#/components/schemas/microsoft.graph.security.ediscoverySearch",
            "#microsoft.graph.security.ediscoveryTagOperation": "#/components/schemas/microsoft.graph.security.ediscoveryTagOperation",
            "#microsoft.graph.security.emailContentThreatSubmission": "#/components/schemas/microsoft.graph.security.emailContentThreatSubmission",
            "#microsoft.graph.security.emailThreatSubmission": "#/components/schemas/microsoft.graph.security.emailThreatSubmission",
            "#microsoft.graph.security.emailThreatSubmissionPolicy": "#/components/schemas/microsoft.graph.security.emailThreatSubmissionPolicy",
            "#microsoft.graph.security.emailUrlThreatSubmission": "#/components/schemas/microsoft.graph.security.emailUrlThreatSubmission",
            "#microsoft.graph.security.file": "#/components/schemas/microsoft.graph.security.file",
            "#microsoft.graph.security.fileContentThreatSubmission": "#/components/schemas/microsoft.graph.security.fileContentThreatSubmission",
            "#microsoft.graph.security.fileThreatSubmission": "#/components/schemas/microsoft.graph.security.fileThreatSubmission",
            "#microsoft.graph.security.fileUrlThreatSubmission": "#/components/schemas/microsoft.graph.security.fileUrlThreatSubmission",
            "#microsoft.graph.security.incident": "#/components/schemas/microsoft.graph.security.incident",
            "#microsoft.graph.security.informationProtection": "#/components/schemas/microsoft.graph.security.informationProtection",
            "#microsoft.graph.security.informationProtectionPolicySetting": "#/components/schemas/microsoft.graph.security.informationProtectionPolicySetting",
            "#microsoft.graph.security.labelsRoot": "#/components/schemas/microsoft.graph.security.labelsRoot",
            "#microsoft.graph.security.policyBase": "#/components/schemas/microsoft.graph.security.policyBase",
            "#microsoft.graph.security.retentionEvent": "#/components/schemas/microsoft.graph.security.retentionEvent",
            "#microsoft.graph.security.retentionEventType": "#/components/schemas/microsoft.graph.security.retentionEventType",
            "#microsoft.graph.security.retentionLabel": "#/components/schemas/microsoft.graph.security.retentionLabel",
            "#microsoft.graph.security.search": "#/components/schemas/microsoft.graph.security.search",
            "#microsoft.graph.security.security": "#/components/schemas/microsoft.graph.security.security",
            "#microsoft.graph.security.sensitivityLabel": "#/components/schemas/microsoft.graph.security.sensitivityLabel",
            "#microsoft.graph.security.siteSource": "#/components/schemas/microsoft.graph.security.siteSource",
            "#microsoft.graph.security.tag": "#/components/schemas/microsoft.graph.security.tag",
            "#microsoft.graph.security.threatSubmission": "#/components/schemas/microsoft.graph.security.threatSubmission",
            "#microsoft.graph.security.threatSubmissionRoot": "#/components/schemas/microsoft.graph.security.threatSubmissionRoot",
            "#microsoft.graph.security.triggerTypesRoot": "#/components/schemas/microsoft.graph.security.triggerTypesRoot",
            "#microsoft.graph.security.triggersRoot": "#/components/schemas/microsoft.graph.security.triggersRoot",
            "#microsoft.graph.security.unifiedGroupSource": "#/components/schemas/microsoft.graph.security.unifiedGroupSource",
            "#microsoft.graph.security.urlThreatSubmission": "#/components/schemas/microsoft.graph.security.urlThreatSubmission",
            "#microsoft.graph.security.userSource": "#/components/schemas/microsoft.graph.security.userSource",
            "#microsoft.graph.securityAction": "#/components/schemas/microsoft.graph.securityAction",
            "#microsoft.graph.securityBaselineCategoryStateSummary": "#/components/schemas/microsoft.graph.securityBaselineCategoryStateSummary",
            "#microsoft.graph.securityBaselineDeviceState": "#/components/schemas/microsoft.graph.securityBaselineDeviceState",
            "#microsoft.graph.securityBaselineSettingState": "#/components/schemas/microsoft.graph.securityBaselineSettingState",
            "#microsoft.graph.securityBaselineState": "#/components/schemas/microsoft.graph.securityBaselineState",
            "#microsoft.graph.securityBaselineStateSummary": "#/components/schemas/microsoft.graph.securityBaselineStateSummary",
            "#microsoft.graph.securityBaselineTemplate": "#/components/schemas/microsoft.graph.securityBaselineTemplate",
            "#microsoft.graph.securityConfigurationTask": "#/components/schemas/microsoft.graph.securityConfigurationTask",
            "#microsoft.graph.securityReportsRoot": "#/components/schemas/microsoft.graph.securityReportsRoot",
            "#microsoft.graph.sensitiveType": "#/components/schemas/microsoft.graph.sensitiveType",
            "#microsoft.graph.sensitivityLabel": "#/components/schemas/microsoft.graph.sensitivityLabel",
            "#microsoft.graph.sensitivityPolicySettings": "#/components/schemas/microsoft.graph.sensitivityPolicySettings",
            "#microsoft.graph.serviceAnnouncement": "#/components/schemas/microsoft.graph.serviceAnnouncement",
            "#microsoft.graph.serviceAnnouncementAttachment": "#/components/schemas/microsoft.graph.serviceAnnouncementAttachment",
            "#microsoft.graph.serviceAnnouncementBase": "#/components/schemas/microsoft.graph.serviceAnnouncementBase",
            "#microsoft.graph.serviceHealth": "#/components/schemas/microsoft.graph.serviceHealth",
            "#microsoft.graph.serviceHealthIssue": "#/components/schemas/microsoft.graph.serviceHealthIssue",
            "#microsoft.graph.serviceNowConnection": "#/components/schemas/microsoft.graph.serviceNowConnection",
            "#microsoft.graph.servicePrincipal": "#/components/schemas/microsoft.graph.servicePrincipal",
            "#microsoft.graph.servicePrincipalCreationConditionSet": "#/components/schemas/microsoft.graph.servicePrincipalCreationConditionSet",
            "#microsoft.graph.servicePrincipalCreationPolicy": "#/components/schemas/microsoft.graph.servicePrincipalCreationPolicy",
            "#microsoft.graph.servicePrincipalRiskDetection": "#/components/schemas/microsoft.graph.servicePrincipalRiskDetection",
            "#microsoft.graph.serviceUpdateMessage": "#/components/schemas/microsoft.graph.serviceUpdateMessage",
            "#microsoft.graph.settingStateDeviceSummary": "#/components/schemas/microsoft.graph.settingStateDeviceSummary",
            "#microsoft.graph.sharedDriveItem": "#/components/schemas/microsoft.graph.sharedDriveItem",
            "#microsoft.graph.sharedEmailDomain": "#/components/schemas/microsoft.graph.sharedEmailDomain",
            "#microsoft.graph.sharedEmailDomainInvitation": "#/components/schemas/microsoft.graph.sharedEmailDomainInvitation",
            "#microsoft.graph.sharedInsight": "#/components/schemas/microsoft.graph.sharedInsight",
            "#microsoft.graph.sharedPCConfiguration": "#/components/schemas/microsoft.graph.sharedPCConfiguration",
            "#microsoft.graph.sharedWithChannelTeamInfo": "#/components/schemas/microsoft.graph.sharedWithChannelTeamInfo",
            "#microsoft.graph.shift": "#/components/schemas/microsoft.graph.shift",
            "#microsoft.graph.shiftPreferences": "#/components/schemas/microsoft.graph.shiftPreferences",
            "#microsoft.graph.shipmentMethod": "#/components/schemas/microsoft.graph.shipmentMethod",
            "#microsoft.graph.signIn": "#/components/schemas/microsoft.graph.signIn",
            "#microsoft.graph.simulation": "#/components/schemas/microsoft.graph.simulation",
            "#microsoft.graph.simulationAutomation": "#/components/schemas/microsoft.graph.simulationAutomation",
            "#microsoft.graph.simulationAutomationRun": "#/components/schemas/microsoft.graph.simulationAutomationRun",
            "#microsoft.graph.singleValueLegacyExtendedProperty": "#/components/schemas/microsoft.graph.singleValueLegacyExtendedProperty",
            "#microsoft.graph.site": "#/components/schemas/microsoft.graph.site",
            "#microsoft.graph.sitePage": "#/components/schemas/microsoft.graph.sitePage",
            "#microsoft.graph.skillProficiency": "#/components/schemas/microsoft.graph.skillProficiency",
            "#microsoft.graph.skypeForBusinessUserConversationMember": "#/components/schemas/microsoft.graph.skypeForBusinessUserConversationMember",
            "#microsoft.graph.skypeUserConversationMember": "#/components/schemas/microsoft.graph.skypeUserConversationMember",
            "#microsoft.graph.smsAuthenticationMethodConfiguration": "#/components/schemas/microsoft.graph.smsAuthenticationMethodConfiguration",
            "#microsoft.graph.smsAuthenticationMethodTarget": "#/components/schemas/microsoft.graph.smsAuthenticationMethodTarget",
            "#microsoft.graph.socialIdentityProvider": "#/components/schemas/microsoft.graph.socialIdentityProvider",
            "#microsoft.graph.softwareOathAuthenticationMethod": "#/components/schemas/microsoft.graph.softwareOathAuthenticationMethod",
            "#microsoft.graph.softwareOathAuthenticationMethodConfiguration": "#/components/schemas/microsoft.graph.softwareOathAuthenticationMethodConfiguration",
            "#microsoft.graph.softwareUpdateStatusSummary": "#/components/schemas/microsoft.graph.softwareUpdateStatusSummary",
            "#microsoft.graph.standardWebPart": "#/components/schemas/microsoft.graph.standardWebPart",
            "#microsoft.graph.startHoldMusicOperation": "#/components/schemas/microsoft.graph.startHoldMusicOperation",
            "#microsoft.graph.stopHoldMusicOperation": "#/components/schemas/microsoft.graph.stopHoldMusicOperation",
            "#microsoft.graph.strongAuthenticationDetail": "#/components/schemas/microsoft.graph.strongAuthenticationDetail",
            "#microsoft.graph.strongAuthenticationPhoneAppDetail": "#/components/schemas/microsoft.graph.strongAuthenticationPhoneAppDetail",
            "#microsoft.graph.stsPolicy": "#/components/schemas/microsoft.graph.stsPolicy",
            "#microsoft.graph.subjectRightsRequest": "#/components/schemas/microsoft.graph.subjectRightsRequest",
            "#microsoft.graph.subscribeToToneOperation": "#/components/schemas/microsoft.graph.subscribeToToneOperation",
            "#microsoft.graph.subscribedSku": "#/components/schemas/microsoft.graph.subscribedSku",
            "#microsoft.graph.subscription": "#/components/schemas/microsoft.graph.subscription",
            "#microsoft.graph.swapShiftsChangeRequest": "#/components/schemas/microsoft.graph.swapShiftsChangeRequest",
            "#microsoft.graph.symantecCodeSigningCertificate": "#/components/schemas/microsoft.graph.symantecCodeSigningCertificate",
            "#microsoft.graph.synchronization": "#/components/schemas/microsoft.graph.synchronization",
            "#microsoft.graph.synchronizationJob": "#/components/schemas/microsoft.graph.synchronizationJob",
            "#microsoft.graph.synchronizationSchema": "#/components/schemas/microsoft.graph.synchronizationSchema",
            "#microsoft.graph.synchronizationTemplate": "#/components/schemas/microsoft.graph.synchronizationTemplate",
            "#microsoft.graph.targetedManagedAppConfiguration": "#/components/schemas/microsoft.graph.targetedManagedAppConfiguration",
            "#microsoft.graph.targetedManagedAppConfigurationPolicySetItem": "#/components/schemas/microsoft.graph.targetedManagedAppConfigurationPolicySetItem",
            "#microsoft.graph.targetedManagedAppPolicyAssignment": "#/components/schemas/microsoft.graph.targetedManagedAppPolicyAssignment",
            "#microsoft.graph.targetedManagedAppProtection": "#/components/schemas/microsoft.graph.targetedManagedAppProtection",
            "#microsoft.graph.taskFileAttachment": "#/components/schemas/microsoft.graph.taskFileAttachment",
            "#microsoft.graph.taxArea": "#/components/schemas/microsoft.graph.taxArea",
            "#microsoft.graph.taxGroup": "#/components/schemas/microsoft.graph.taxGroup",
            "#microsoft.graph.team": "#/components/schemas/microsoft.graph.team",
            "#microsoft.graph.teamInfo": "#/components/schemas/microsoft.graph.teamInfo",
            "#microsoft.graph.teamTemplate": "#/components/schemas/microsoft.graph.teamTemplate",
            "#microsoft.graph.teamTemplateDefinition": "#/components/schemas/microsoft.graph.teamTemplateDefinition",
            "#microsoft.graph.teamsApp": "#/components/schemas/microsoft.graph.teamsApp",
            "#microsoft.graph.teamsAppDefinition": "#/components/schemas/microsoft.graph.teamsAppDefinition",
            "#microsoft.graph.teamsAppIcon": "#/components/schemas/microsoft.graph.teamsAppIcon",
            "#microsoft.graph.teamsAppInstallation": "#/components/schemas/microsoft.graph.teamsAppInstallation",
            "#microsoft.graph.teamsAppSettings": "#/components/schemas/microsoft.graph.teamsAppSettings",
            "#microsoft.graph.teamsAsyncOperation": "#/components/schemas/microsoft.graph.teamsAsyncOperation",
            "#microsoft.graph.teamsTab": "#/components/schemas/microsoft.graph.teamsTab",
            "#microsoft.graph.teamsTemplate": "#/components/schemas/microsoft.graph.teamsTemplate",
            "#microsoft.graph.teamwork": "#/components/schemas/microsoft.graph.teamwork",
            "#microsoft.graph.teamworkBot": "#/components/schemas/microsoft.graph.teamworkBot",
            "#microsoft.graph.teamworkDevice": "#/components/schemas/microsoft.graph.teamworkDevice",
            "#microsoft.graph.teamworkDeviceActivity": "#/components/schemas/microsoft.graph.teamworkDeviceActivity",
            "#microsoft.graph.teamworkDeviceConfiguration": "#/components/schemas/microsoft.graph.teamworkDeviceConfiguration",
            "#microsoft.graph.teamworkDeviceHealth": "#/components/schemas/microsoft.graph.teamworkDeviceHealth",
            "#microsoft.graph.teamworkDeviceOperation": "#/components/schemas/microsoft.graph.teamworkDeviceOperation",
            "#microsoft.graph.teamworkHostedContent": "#/components/schemas/microsoft.graph.teamworkHostedContent",
            "#microsoft.graph.teamworkPeripheral": "#/components/schemas/microsoft.graph.teamworkPeripheral",
            "#microsoft.graph.teamworkTag": "#/components/schemas/microsoft.graph.teamworkTag",
            "#microsoft.graph.teamworkTagMember": "#/components/schemas/microsoft.graph.teamworkTagMember",
            "#microsoft.graph.telecomExpenseManagementPartner": "#/components/schemas/microsoft.graph.telecomExpenseManagementPartner",
            "#microsoft.graph.temporaryAccessPassAuthenticationMethod": "#/components/schemas/microsoft.graph.temporaryAccessPassAuthenticationMethod",
            "#microsoft.graph.temporaryAccessPassAuthenticationMethodConfiguration": "#/components/schemas/microsoft.graph.temporaryAccessPassAuthenticationMethodConfiguration",
            "#microsoft.graph.tenantAdmin.settings": "#/components/schemas/microsoft.graph.tenantAdmin.settings",
            "#microsoft.graph.tenantAdmin.sharepoint": "#/components/schemas/microsoft.graph.tenantAdmin.sharepoint",
            "#microsoft.graph.tenantAppManagementPolicy": "#/components/schemas/microsoft.graph.tenantAppManagementPolicy",
            "#microsoft.graph.tenantAttachRBAC": "#/components/schemas/microsoft.graph.tenantAttachRBAC",
            "#microsoft.graph.tenantRelationshipAccessPolicyBase": "#/components/schemas/microsoft.graph.tenantRelationshipAccessPolicyBase",
            "#microsoft.graph.tenantSetupInfo": "#/components/schemas/microsoft.graph.tenantSetupInfo",
            "#microsoft.graph.termStore.group": "#/components/schemas/microsoft.graph.termStore.group",
            "#microsoft.graph.termStore.relation": "#/components/schemas/microsoft.graph.termStore.relation",
            "#microsoft.graph.termStore.set": "#/components/schemas/microsoft.graph.termStore.set",
            "#microsoft.graph.termStore.store": "#/components/schemas/microsoft.graph.termStore.store",
            "#microsoft.graph.termStore.term": "#/components/schemas/microsoft.graph.termStore.term",
            "#microsoft.graph.termsAndConditions": "#/components/schemas/microsoft.graph.termsAndConditions",
            "#microsoft.graph.termsAndConditionsAcceptanceStatus": "#/components/schemas/microsoft.graph.termsAndConditionsAcceptanceStatus",
            "#microsoft.graph.termsAndConditionsAssignment": "#/components/schemas/microsoft.graph.termsAndConditionsAssignment",
            "#microsoft.graph.termsAndConditionsGroupAssignment": "#/components/schemas/microsoft.graph.termsAndConditionsGroupAssignment",
            "#microsoft.graph.termsOfUseContainer": "#/components/schemas/microsoft.graph.termsOfUseContainer",
            "#microsoft.graph.textClassificationRequest": "#/components/schemas/microsoft.graph.textClassificationRequest",
            "#microsoft.graph.textWebPart": "#/components/schemas/microsoft.graph.textWebPart",
            "#microsoft.graph.threatAssessmentRequest": "#/components/schemas/microsoft.graph.threatAssessmentRequest",
            "#microsoft.graph.threatAssessmentResult": "#/components/schemas/microsoft.graph.threatAssessmentResult",
            "#microsoft.graph.thumbnailSet": "#/components/schemas/microsoft.graph.thumbnailSet",
            "#microsoft.graph.tiIndicator": "#/components/schemas/microsoft.graph.tiIndicator",
            "#microsoft.graph.timeCard": "#/components/schemas/microsoft.graph.timeCard",
            "#microsoft.graph.timeOff": "#/components/schemas/microsoft.graph.timeOff",
            "#microsoft.graph.timeOffReason": "#/components/schemas/microsoft.graph.timeOffReason",
            "#microsoft.graph.timeOffRequest": "#/components/schemas/microsoft.graph.timeOffRequest",
            "#microsoft.graph.todo": "#/components/schemas/microsoft.graph.todo",
            "#microsoft.graph.todoTask": "#/components/schemas/microsoft.graph.todoTask",
            "#microsoft.graph.todoTaskList": "#/components/schemas/microsoft.graph.todoTaskList",
            "#microsoft.graph.tokenIssuancePolicy": "#/components/schemas/microsoft.graph.tokenIssuancePolicy",
            "#microsoft.graph.tokenLifetimePolicy": "#/components/schemas/microsoft.graph.tokenLifetimePolicy",
            "#microsoft.graph.trending": "#/components/schemas/microsoft.graph.trending",
            "#microsoft.graph.trustFrameworkKeySet": "#/components/schemas/microsoft.graph.trustFrameworkKeySet",
            "#microsoft.graph.trustFrameworkPolicy": "#/components/schemas/microsoft.graph.trustFrameworkPolicy",
            "#microsoft.graph.unifiedRbacApplication": "#/components/schemas/microsoft.graph.unifiedRbacApplication",
            "#microsoft.graph.unifiedRbacResourceAction": "#/components/schemas/microsoft.graph.unifiedRbacResourceAction",
            "#microsoft.graph.unifiedRbacResourceNamespace": "#/components/schemas/microsoft.graph.unifiedRbacResourceNamespace",
            "#microsoft.graph.unifiedRbacResourceScope": "#/components/schemas/microsoft.graph.unifiedRbacResourceScope",
            "#microsoft.graph.unifiedRoleAssignment": "#/components/schemas/microsoft.graph.unifiedRoleAssignment",
            "#microsoft.graph.unifiedRoleAssignmentMultiple": "#/components/schemas/microsoft.graph.unifiedRoleAssignmentMultiple",
            "#microsoft.graph.unifiedRoleAssignmentSchedule": "#/components/schemas/microsoft.graph.unifiedRoleAssignmentSchedule",
            "#microsoft.graph.unifiedRoleAssignmentScheduleInstance": "#/components/schemas/microsoft.graph.unifiedRoleAssignmentScheduleInstance",
            "#microsoft.graph.unifiedRoleAssignmentScheduleRequest": "#/components/schemas/microsoft.graph.unifiedRoleAssignmentScheduleRequest",
            "#microsoft.graph.unifiedRoleDefinition": "#/components/schemas/microsoft.graph.unifiedRoleDefinition",
            "#microsoft.graph.unifiedRoleEligibilitySchedule": "#/components/schemas/microsoft.graph.unifiedRoleEligibilitySchedule",
            "#microsoft.graph.unifiedRoleEligibilityScheduleInstance": "#/components/schemas/microsoft.graph.unifiedRoleEligibilityScheduleInstance",
            "#microsoft.graph.unifiedRoleEligibilityScheduleRequest": "#/components/schemas/microsoft.graph.unifiedRoleEligibilityScheduleRequest",
            "#microsoft.graph.unifiedRoleManagementPolicy": "#/components/schemas/microsoft.graph.unifiedRoleManagementPolicy",
            "#microsoft.graph.unifiedRoleManagementPolicyApprovalRule": "#/components/schemas/microsoft.graph.unifiedRoleManagementPolicyApprovalRule",
            "#microsoft.graph.unifiedRoleManagementPolicyAssignment": "#/components/schemas/microsoft.graph.unifiedRoleManagementPolicyAssignment",
            "#microsoft.graph.unifiedRoleManagementPolicyAuthenticationContextRule": "#/components/schemas/microsoft.graph.unifiedRoleManagementPolicyAuthenticationContextRule",
            "#microsoft.graph.unifiedRoleManagementPolicyEnablementRule": "#/components/schemas/microsoft.graph.unifiedRoleManagementPolicyEnablementRule",
            "#microsoft.graph.unifiedRoleManagementPolicyExpirationRule": "#/components/schemas/microsoft.graph.unifiedRoleManagementPolicyExpirationRule",
            "#microsoft.graph.unifiedRoleManagementPolicyNotificationRule": "#/components/schemas/microsoft.graph.unifiedRoleManagementPolicyNotificationRule",
            "#microsoft.graph.unifiedRoleManagementPolicyRule": "#/components/schemas/microsoft.graph.unifiedRoleManagementPolicyRule",
            "#microsoft.graph.unifiedRoleScheduleBase": "#/components/schemas/microsoft.graph.unifiedRoleScheduleBase",
            "#microsoft.graph.unifiedRoleScheduleInstanceBase": "#/components/schemas/microsoft.graph.unifiedRoleScheduleInstanceBase",
            "#microsoft.graph.unitOfMeasure": "#/components/schemas/microsoft.graph.unitOfMeasure",
            "#microsoft.graph.unmanagedDeviceDiscoveryTask": "#/components/schemas/microsoft.graph.unmanagedDeviceDiscoveryTask",
            "#microsoft.graph.unmuteParticipantOperation": "#/components/schemas/microsoft.graph.unmuteParticipantOperation",
            "#microsoft.graph.unsupportedDeviceConfiguration": "#/components/schemas/microsoft.graph.unsupportedDeviceConfiguration",
            "#microsoft.graph.unsupportedGroupPolicyExtension": "#/components/schemas/microsoft.graph.unsupportedGroupPolicyExtension",
            "#microsoft.graph.updateRecordingStatusOperation": "#/components/schemas/microsoft.graph.updateRecordingStatusOperation",
            "#microsoft.graph.urlAssessmentRequest": "#/components/schemas/microsoft.graph.urlAssessmentRequest",
            "#microsoft.graph.usageRight": "#/components/schemas/microsoft.graph.usageRight",
            "#microsoft.graph.usedInsight": "#/components/schemas/microsoft.graph.usedInsight",
            "#microsoft.graph.user": "#/components/schemas/microsoft.graph.user",
            "#microsoft.graph.userAccountInformation": "#/components/schemas/microsoft.graph.userAccountInformation",
            "#microsoft.graph.userActivity": "#/components/schemas/microsoft.graph.userActivity",
            "#microsoft.graph.userAnalytics": "#/components/schemas/microsoft.graph.userAnalytics",
            "#microsoft.graph.userAppInstallStatus": "#/components/schemas/microsoft.graph.userAppInstallStatus",
            "#microsoft.graph.userConfiguration": "#/components/schemas/microsoft.graph.userConfiguration",
            "#microsoft.graph.userConsentRequest": "#/components/schemas/microsoft.graph.userConsentRequest",
            "#microsoft.graph.userCredentialUsageDetails": "#/components/schemas/microsoft.graph.userCredentialUsageDetails",
            "#microsoft.graph.userExperienceAnalyticsAnomaly": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAnomaly",
            "#microsoft.graph.userExperienceAnalyticsAnomalyDevice": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAnomalyDevice",
            "#microsoft.graph.userExperienceAnalyticsAppHealthAppPerformanceByAppVersion": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAppHealthAppPerformanceByAppVersion",
            "#microsoft.graph.userExperienceAnalyticsAppHealthAppPerformanceByAppVersionDetails": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAppHealthAppPerformanceByAppVersionDetails",
            "#microsoft.graph.userExperienceAnalyticsAppHealthAppPerformanceByAppVersionDeviceId": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAppHealthAppPerformanceByAppVersionDeviceId",
            "#microsoft.graph.userExperienceAnalyticsAppHealthAppPerformanceByOSVersion": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAppHealthAppPerformanceByOSVersion",
            "#microsoft.graph.userExperienceAnalyticsAppHealthApplicationPerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAppHealthApplicationPerformance",
            "#microsoft.graph.userExperienceAnalyticsAppHealthDeviceModelPerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAppHealthDeviceModelPerformance",
            "#microsoft.graph.userExperienceAnalyticsAppHealthDevicePerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAppHealthDevicePerformance",
            "#microsoft.graph.userExperienceAnalyticsAppHealthDevicePerformanceDetails": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAppHealthDevicePerformanceDetails",
            "#microsoft.graph.userExperienceAnalyticsAppHealthOSVersionPerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsAppHealthOSVersionPerformance",
            "#microsoft.graph.userExperienceAnalyticsBaseline": "#/components/schemas/microsoft.graph.userExperienceAnalyticsBaseline",
            "#microsoft.graph.userExperienceAnalyticsBatteryHealthAppImpact": "#/components/schemas/microsoft.graph.userExperienceAnalyticsBatteryHealthAppImpact",
            "#microsoft.graph.userExperienceAnalyticsBatteryHealthCapacityDetails": "#/components/schemas/microsoft.graph.userExperienceAnalyticsBatteryHealthCapacityDetails",
            "#microsoft.graph.userExperienceAnalyticsBatteryHealthDeviceAppImpact": "#/components/schemas/microsoft.graph.userExperienceAnalyticsBatteryHealthDeviceAppImpact",
            "#microsoft.graph.userExperienceAnalyticsBatteryHealthDevicePerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsBatteryHealthDevicePerformance",
            "#microsoft.graph.userExperienceAnalyticsBatteryHealthDeviceRuntimeHistory": "#/components/schemas/microsoft.graph.userExperienceAnalyticsBatteryHealthDeviceRuntimeHistory",
            "#microsoft.graph.userExperienceAnalyticsBatteryHealthModelPerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsBatteryHealthModelPerformance",
            "#microsoft.graph.userExperienceAnalyticsBatteryHealthOsPerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsBatteryHealthOsPerformance",
            "#microsoft.graph.userExperienceAnalyticsBatteryHealthRuntimeDetails": "#/components/schemas/microsoft.graph.userExperienceAnalyticsBatteryHealthRuntimeDetails",
            "#microsoft.graph.userExperienceAnalyticsCategory": "#/components/schemas/microsoft.graph.userExperienceAnalyticsCategory",
            "#microsoft.graph.userExperienceAnalyticsDevicePerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsDevicePerformance",
            "#microsoft.graph.userExperienceAnalyticsDeviceScope": "#/components/schemas/microsoft.graph.userExperienceAnalyticsDeviceScope",
            "#microsoft.graph.userExperienceAnalyticsDeviceScores": "#/components/schemas/microsoft.graph.userExperienceAnalyticsDeviceScores",
            "#microsoft.graph.userExperienceAnalyticsDeviceStartupHistory": "#/components/schemas/microsoft.graph.userExperienceAnalyticsDeviceStartupHistory",
            "#microsoft.graph.userExperienceAnalyticsDeviceStartupProcess": "#/components/schemas/microsoft.graph.userExperienceAnalyticsDeviceStartupProcess",
            "#microsoft.graph.userExperienceAnalyticsDeviceStartupProcessPerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsDeviceStartupProcessPerformance",
            "#microsoft.graph.userExperienceAnalyticsDeviceTimelineEvent": "#/components/schemas/microsoft.graph.userExperienceAnalyticsDeviceTimelineEvent",
            "#microsoft.graph.userExperienceAnalyticsDeviceWithoutCloudIdentity": "#/components/schemas/microsoft.graph.userExperienceAnalyticsDeviceWithoutCloudIdentity",
            "#microsoft.graph.userExperienceAnalyticsImpactingProcess": "#/components/schemas/microsoft.graph.userExperienceAnalyticsImpactingProcess",
            "#microsoft.graph.userExperienceAnalyticsMetric": "#/components/schemas/microsoft.graph.userExperienceAnalyticsMetric",
            "#microsoft.graph.userExperienceAnalyticsMetricHistory": "#/components/schemas/microsoft.graph.userExperienceAnalyticsMetricHistory",
            "#microsoft.graph.userExperienceAnalyticsModelScores": "#/components/schemas/microsoft.graph.userExperienceAnalyticsModelScores",
            "#microsoft.graph.userExperienceAnalyticsNotAutopilotReadyDevice": "#/components/schemas/microsoft.graph.userExperienceAnalyticsNotAutopilotReadyDevice",
            "#microsoft.graph.userExperienceAnalyticsOverview": "#/components/schemas/microsoft.graph.userExperienceAnalyticsOverview",
            "#microsoft.graph.userExperienceAnalyticsRemoteConnection": "#/components/schemas/microsoft.graph.userExperienceAnalyticsRemoteConnection",
            "#microsoft.graph.userExperienceAnalyticsResourcePerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsResourcePerformance",
            "#microsoft.graph.userExperienceAnalyticsScoreHistory": "#/components/schemas/microsoft.graph.userExperienceAnalyticsScoreHistory",
            "#microsoft.graph.userExperienceAnalyticsWorkFromAnywhereDevice": "#/components/schemas/microsoft.graph.userExperienceAnalyticsWorkFromAnywhereDevice",
            "#microsoft.graph.userExperienceAnalyticsWorkFromAnywhereHardwareReadinessMetric": "#/components/schemas/microsoft.graph.userExperienceAnalyticsWorkFromAnywhereHardwareReadinessMetric",
            "#microsoft.graph.userExperienceAnalyticsWorkFromAnywhereMetric": "#/components/schemas/microsoft.graph.userExperienceAnalyticsWorkFromAnywhereMetric",
            "#microsoft.graph.userExperienceAnalyticsWorkFromAnywhereModelPerformance": "#/components/schemas/microsoft.graph.userExperienceAnalyticsWorkFromAnywhereModelPerformance",
            "#microsoft.graph.userFlowLanguageConfiguration": "#/components/schemas/microsoft.graph.userFlowLanguageConfiguration",
            "#microsoft.graph.userFlowLanguagePage": "#/components/schemas/microsoft.graph.userFlowLanguagePage",
            "#microsoft.graph.userInsightsSettings": "#/components/schemas/microsoft.graph.userInsightsSettings",
            "#microsoft.graph.userInstallStateSummary": "#/components/schemas/microsoft.graph.userInstallStateSummary",
            "#microsoft.graph.userPFXCertificate": "#/components/schemas/microsoft.graph.userPFXCertificate",
            "#microsoft.graph.userRegistrationDetails": "#/components/schemas/microsoft.graph.userRegistrationDetails",
            "#microsoft.graph.userScopeTeamsAppInstallation": "#/components/schemas/microsoft.graph.userScopeTeamsAppInstallation",
            "#microsoft.graph.userSecurityProfile": "#/components/schemas/microsoft.graph.userSecurityProfile",
            "#microsoft.graph.userSettings": "#/components/schemas/microsoft.graph.userSettings",
            "#microsoft.graph.userSignInInsight": "#/components/schemas/microsoft.graph.userSignInInsight",
            "#microsoft.graph.userTeamwork": "#/components/schemas/microsoft.graph.userTeamwork",
            "#microsoft.graph.vendor": "#/components/schemas/microsoft.graph.vendor",
            "#microsoft.graph.verticalSection": "#/components/schemas/microsoft.graph.verticalSection",
            "#microsoft.graph.virtualAppointment": "#/components/schemas/microsoft.graph.virtualAppointment",
            "#microsoft.graph.virtualEndpoint": "#/components/schemas/microsoft.graph.virtualEndpoint",
            "#microsoft.graph.voiceAuthenticationMethodConfiguration": "#/components/schemas/microsoft.graph.voiceAuthenticationMethodConfiguration",
            "#microsoft.graph.voiceAuthenticationMethodTarget": "#/components/schemas/microsoft.graph.voiceAuthenticationMethodTarget",
            "#microsoft.graph.vpnConfiguration": "#/components/schemas/microsoft.graph.vpnConfiguration",
            "#microsoft.graph.vppToken": "#/components/schemas/microsoft.graph.vppToken",
            "#microsoft.graph.vulnerableManagedDevice": "#/components/schemas/microsoft.graph.vulnerableManagedDevice",
            "#microsoft.graph.webAccount": "#/components/schemas/microsoft.graph.webAccount",
            "#microsoft.graph.webApp": "#/components/schemas/microsoft.graph.webApp",
            "#microsoft.graph.webApplicationSegment": "#/components/schemas/microsoft.graph.webApplicationSegment",
            "#microsoft.graph.webPart": "#/components/schemas/microsoft.graph.webPart",
            "#microsoft.graph.win32LobApp": "#/components/schemas/microsoft.graph.win32LobApp",
            "#microsoft.graph.winGetApp": "#/components/schemas/microsoft.graph.winGetApp",
            "#microsoft.graph.windows10CertificateProfileBase": "#/components/schemas/microsoft.graph.windows10CertificateProfileBase",
            "#microsoft.graph.windows10CompliancePolicy": "#/components/schemas/microsoft.graph.windows10CompliancePolicy",
            "#microsoft.graph.windows10CustomConfiguration": "#/components/schemas/microsoft.graph.windows10CustomConfiguration",
            "#microsoft.graph.windows10DeviceFirmwareConfigurationInterface": "#/components/schemas/microsoft.graph.windows10DeviceFirmwareConfigurationInterface",
            "#microsoft.graph.windows10EasEmailProfileConfiguration": "#/components/schemas/microsoft.graph.windows10EasEmailProfileConfiguration",
            "#microsoft.graph.windows10EndpointProtectionConfiguration": "#/components/schemas/microsoft.graph.windows10EndpointProtectionConfiguration",
            "#microsoft.graph.windows10EnrollmentCompletionPageConfiguration": "#/components/schemas/microsoft.graph.windows10EnrollmentCompletionPageConfiguration",
            "#microsoft.graph.windows10EnrollmentCompletionPageConfigurationPolicySetItem": "#/components/schemas/microsoft.graph.windows10EnrollmentCompletionPageConfigurationPolicySetItem",
            "#microsoft.graph.windows10EnterpriseModernAppManagementConfiguration": "#/components/schemas/microsoft.graph.windows10EnterpriseModernAppManagementConfiguration",
            "#microsoft.graph.windows10GeneralConfiguration": "#/components/schemas/microsoft.graph.windows10GeneralConfiguration",
            "#microsoft.graph.windows10ImportedPFXCertificateProfile": "#/components/schemas/microsoft.graph.windows10ImportedPFXCertificateProfile",
            "#microsoft.graph.windows10MobileCompliancePolicy": "#/components/schemas/microsoft.graph.windows10MobileCompliancePolicy",
            "#microsoft.graph.windows10NetworkBoundaryConfiguration": "#/components/schemas/microsoft.graph.windows10NetworkBoundaryConfiguration",
            "#microsoft.graph.windows10PFXImportCertificateProfile": "#/components/schemas/microsoft.graph.windows10PFXImportCertificateProfile",
            "#microsoft.graph.windows10PkcsCertificateProfile": "#/components/schemas/microsoft.graph.windows10PkcsCertificateProfile",
            "#microsoft.graph.windows10SecureAssessmentConfiguration": "#/components/schemas/microsoft.graph.windows10SecureAssessmentConfiguration",
            "#microsoft.graph.windows10TeamGeneralConfiguration": "#/components/schemas/microsoft.graph.windows10TeamGeneralConfiguration",
            "#microsoft.graph.windows10VpnConfiguration": "#/components/schemas/microsoft.graph.windows10VpnConfiguration",
            "#microsoft.graph.windows10XCertificateProfile": "#/components/schemas/microsoft.graph.windows10XCertificateProfile",
            "#microsoft.graph.windows10XSCEPCertificateProfile": "#/components/schemas/microsoft.graph.windows10XSCEPCertificateProfile",
            "#microsoft.graph.windows10XTrustedRootCertificate": "#/components/schemas/microsoft.graph.windows10XTrustedRootCertificate",
            "#microsoft.graph.windows10XVpnConfiguration": "#/components/schemas/microsoft.graph.windows10XVpnConfiguration",
            "#microsoft.graph.windows10XWifiConfiguration": "#/components/schemas/microsoft.graph.windows10XWifiConfiguration",
            "#microsoft.graph.windows81CertificateProfileBase": "#/components/schemas/microsoft.graph.windows81CertificateProfileBase",
            "#microsoft.graph.windows81CompliancePolicy": "#/components/schemas/microsoft.graph.windows81CompliancePolicy",
            "#microsoft.graph.windows81GeneralConfiguration": "#/components/schemas/microsoft.graph.windows81GeneralConfiguration",
            "#microsoft.graph.windows81SCEPCertificateProfile": "#/components/schemas/microsoft.graph.windows81SCEPCertificateProfile",
            "#microsoft.graph.windows81TrustedRootCertificate": "#/components/schemas/microsoft.graph.windows81TrustedRootCertificate",
            "#microsoft.graph.windows81VpnConfiguration": "#/components/schemas/microsoft.graph.windows81VpnConfiguration",
            "#microsoft.graph.windows81WifiImportConfiguration": "#/components/schemas/microsoft.graph.windows81WifiImportConfiguration",
            "#microsoft.graph.windowsAppX": "#/components/schemas/microsoft.graph.windowsAppX",
            "#microsoft.graph.windowsAssignedAccessProfile": "#/components/schemas/microsoft.graph.windowsAssignedAccessProfile",
            "#microsoft.graph.windowsAutopilotDeploymentProfile": "#/components/schemas/microsoft.graph.windowsAutopilotDeploymentProfile",
            "#microsoft.graph.windowsAutopilotDeploymentProfileAssignment": "#/components/schemas/microsoft.graph.windowsAutopilotDeploymentProfileAssignment",
            "#microsoft.graph.windowsAutopilotDeploymentProfilePolicySetItem": "#/components/schemas/microsoft.graph.windowsAutopilotDeploymentProfilePolicySetItem",
            "#microsoft.graph.windowsAutopilotDeviceIdentity": "#/components/schemas/microsoft.graph.windowsAutopilotDeviceIdentity",
            "#microsoft.graph.windowsAutopilotSettings": "#/components/schemas/microsoft.graph.windowsAutopilotSettings",
            "#microsoft.graph.windowsCertificateProfileBase": "#/components/schemas/microsoft.graph.windowsCertificateProfileBase",
            "#microsoft.graph.windowsDefenderAdvancedThreatProtectionConfiguration": "#/components/schemas/microsoft.graph.windowsDefenderAdvancedThreatProtectionConfiguration",
            "#microsoft.graph.windowsDefenderApplicationControlSupplementalPolicy": "#/components/schemas/microsoft.graph.windowsDefenderApplicationControlSupplementalPolicy",
            "#microsoft.graph.windowsDefenderApplicationControlSupplementalPolicyAssignment": "#/components/schemas/microsoft.graph.windowsDefenderApplicationControlSupplementalPolicyAssignment",
            "#microsoft.graph.windowsDefenderApplicationControlSupplementalPolicyDeploymentStatus": "#/components/schemas/microsoft.graph.windowsDefenderApplicationControlSupplementalPolicyDeploymentStatus",
            "#microsoft.graph.windowsDefenderApplicationControlSupplementalPolicyDeploymentSummary": "#/components/schemas/microsoft.graph.windowsDefenderApplicationControlSupplementalPolicyDeploymentSummary",
            "#microsoft.graph.windowsDeliveryOptimizationConfiguration": "#/components/schemas/microsoft.graph.windowsDeliveryOptimizationConfiguration",
            "#microsoft.graph.windowsDeviceMalwareState": "#/components/schemas/microsoft.graph.windowsDeviceMalwareState",
            "#microsoft.graph.windowsDomainJoinConfiguration": "#/components/schemas/microsoft.graph.windowsDomainJoinConfiguration",
            "#microsoft.graph.windowsDriverUpdateInventory": "#/components/schemas/microsoft.graph.windowsDriverUpdateInventory",
            "#microsoft.graph.windowsDriverUpdateProfile": "#/components/schemas/microsoft.graph.windowsDriverUpdateProfile",
            "#microsoft.graph.windowsDriverUpdateProfileAssignment": "#/components/schemas/microsoft.graph.windowsDriverUpdateProfileAssignment",
            "#microsoft.graph.windowsFeatureUpdateCatalogItem": "#/components/schemas/microsoft.graph.windowsFeatureUpdateCatalogItem",
            "#microsoft.graph.windowsFeatureUpdateProfile": "#/components/schemas/microsoft.graph.windowsFeatureUpdateProfile",
            "#microsoft.graph.windowsFeatureUpdateProfileAssignment": "#/components/schemas/microsoft.graph.windowsFeatureUpdateProfileAssignment",
            "#microsoft.graph.windowsHealthMonitoringConfiguration": "#/components/schemas/microsoft.graph.windowsHealthMonitoringConfiguration",
            "#microsoft.graph.windowsHelloForBusinessAuthenticationMethod": "#/components/schemas/microsoft.graph.windowsHelloForBusinessAuthenticationMethod",
            "#microsoft.graph.windowsIdentityProtectionConfiguration": "#/components/schemas/microsoft.graph.windowsIdentityProtectionConfiguration",
            "#microsoft.graph.windowsInformationProtection": "#/components/schemas/microsoft.graph.windowsInformationProtection",
            "#microsoft.graph.windowsInformationProtectionAppLearningSummary": "#/components/schemas/microsoft.graph.windowsInformationProtectionAppLearningSummary",
            "#microsoft.graph.windowsInformationProtectionAppLockerFile": "#/components/schemas/microsoft.graph.windowsInformationProtectionAppLockerFile",
            "#microsoft.graph.windowsInformationProtectionDeviceRegistration": "#/components/schemas/microsoft.graph.windowsInformationProtectionDeviceRegistration",
            "#microsoft.graph.windowsInformationProtectionNetworkLearningSummary": "#/components/schemas/microsoft.graph.windowsInformationProtectionNetworkLearningSummary",
            "#microsoft.graph.windowsInformationProtectionPolicy": "#/components/schemas/microsoft.graph.windowsInformationProtectionPolicy",
            "#microsoft.graph.windowsInformationProtectionWipeAction": "#/components/schemas/microsoft.graph.windowsInformationProtectionWipeAction",
            "#microsoft.graph.windowsKioskConfiguration": "#/components/schemas/microsoft.graph.windowsKioskConfiguration",
            "#microsoft.graph.windowsMalwareInformation": "#/components/schemas/microsoft.graph.windowsMalwareInformation",
            "#microsoft.graph.windowsManagedAppProtection": "#/components/schemas/microsoft.graph.windowsManagedAppProtection",
            "#microsoft.graph.windowsManagedDevice": "#/components/schemas/microsoft.graph.windowsManagedDevice",
            "#microsoft.graph.windowsManagementApp": "#/components/schemas/microsoft.graph.windowsManagementApp",
            "#microsoft.graph.windowsManagementAppHealthState": "#/components/schemas/microsoft.graph.windowsManagementAppHealthState",
            "#microsoft.graph.windowsManagementAppHealthSummary": "#/components/schemas/microsoft.graph.windowsManagementAppHealthSummary",
            "#microsoft.graph.windowsMicrosoftEdgeApp": "#/components/schemas/microsoft.graph.windowsMicrosoftEdgeApp",
            "#microsoft.graph.windowsMobileMSI": "#/components/schemas/microsoft.graph.windowsMobileMSI",
            "#microsoft.graph.windowsOfficeClientConfiguration": "#/components/schemas/microsoft.graph.windowsOfficeClientConfiguration",
            "#microsoft.graph.windowsOfficeClientSecurityConfiguration": "#/components/schemas/microsoft.graph.windowsOfficeClientSecurityConfiguration",
            "#microsoft.graph.windowsPhone81AppX": "#/components/schemas/microsoft.graph.windowsPhone81AppX",
            "#microsoft.graph.windowsPhone81AppXBundle": "#/components/schemas/microsoft.graph.windowsPhone81AppXBundle",
            "#microsoft.graph.windowsPhone81CertificateProfileBase": "#/components/schemas/microsoft.graph.windowsPhone81CertificateProfileBase",
            "#microsoft.graph.windowsPhone81CompliancePolicy": "#/components/schemas/microsoft.graph.windowsPhone81CompliancePolicy",
            "#microsoft.graph.windowsPhone81CustomConfiguration": "#/components/schemas/microsoft.graph.windowsPhone81CustomConfiguration",
            "#microsoft.graph.windowsPhone81GeneralConfiguration": "#/components/schemas/microsoft.graph.windowsPhone81GeneralConfiguration",
            "#microsoft.graph.windowsPhone81ImportedPFXCertificateProfile": "#/components/schemas/microsoft.graph.windowsPhone81ImportedPFXCertificateProfile",
            "#microsoft.graph.windowsPhone81SCEPCertificateProfile": "#/components/schemas/microsoft.graph.windowsPhone81SCEPCertificateProfile",
            "#microsoft.graph.windowsPhone81StoreApp": "#/components/schemas/microsoft.graph.windowsPhone81StoreApp",
            "#microsoft.graph.windowsPhone81TrustedRootCertificate": "#/components/schemas/microsoft.graph.windowsPhone81TrustedRootCertificate",
            "#microsoft.graph.windowsPhone81VpnConfiguration": "#/components/schemas/microsoft.graph.windowsPhone81VpnConfiguration",
            "#microsoft.graph.windowsPhoneEASEmailProfileConfiguration": "#/components/schemas/microsoft.graph.windowsPhoneEASEmailProfileConfiguration",
            "#microsoft.graph.windowsPhoneXAP": "#/components/schemas/microsoft.graph.windowsPhoneXAP",
            "#microsoft.graph.windowsPrivacyDataAccessControlItem": "#/components/schemas/microsoft.graph.windowsPrivacyDataAccessControlItem",
            "#microsoft.graph.windowsProtectionState": "#/components/schemas/microsoft.graph.windowsProtectionState",
            "#microsoft.graph.windowsQualityUpdateCatalogItem": "#/components/schemas/microsoft.graph.windowsQualityUpdateCatalogItem",
            "#microsoft.graph.windowsQualityUpdateProfile": "#/components/schemas/microsoft.graph.windowsQualityUpdateProfile",
            "#microsoft.graph.windowsQualityUpdateProfileAssignment": "#/components/schemas/microsoft.graph.windowsQualityUpdateProfileAssignment",
            "#microsoft.graph.windowsStoreApp": "#/components/schemas/microsoft.graph.windowsStoreApp",
            "#microsoft.graph.windowsUniversalAppX": "#/components/schemas/microsoft.graph.windowsUniversalAppX",
            "#microsoft.graph.windowsUniversalAppXContainedApp": "#/components/schemas/microsoft.graph.windowsUniversalAppXContainedApp",
            "#microsoft.graph.windowsUpdateCatalogItem": "#/components/schemas/microsoft.graph.windowsUpdateCatalogItem",
            "#microsoft.graph.windowsUpdateForBusinessConfiguration": "#/components/schemas/microsoft.graph.windowsUpdateForBusinessConfiguration",
            "#microsoft.graph.windowsUpdateState": "#/components/schemas/microsoft.graph.windowsUpdateState",
            "#microsoft.graph.windowsUpdates.azureADDevice": "#/components/schemas/microsoft.graph.windowsUpdates.azureADDevice",
            "#microsoft.graph.windowsUpdates.catalog": "#/components/schemas/microsoft.graph.windowsUpdates.catalog",
            "#microsoft.graph.windowsUpdates.catalogEntry": "#/components/schemas/microsoft.graph.windowsUpdates.catalogEntry",
            "#microsoft.graph.windowsUpdates.complianceChange": "#/components/schemas/microsoft.graph.windowsUpdates.complianceChange",
            "#microsoft.graph.windowsUpdates.contentApproval": "#/components/schemas/microsoft.graph.windowsUpdates.contentApproval",
            "#microsoft.graph.windowsUpdates.deployment": "#/components/schemas/microsoft.graph.windowsUpdates.deployment",
            "#microsoft.graph.windowsUpdates.deploymentAudience": "#/components/schemas/microsoft.graph.windowsUpdates.deploymentAudience",
            "#microsoft.graph.windowsUpdates.driverUpdateCatalogEntry": "#/components/schemas/microsoft.graph.windowsUpdates.driverUpdateCatalogEntry",
            "#microsoft.graph.windowsUpdates.featureUpdateCatalogEntry": "#/components/schemas/microsoft.graph.windowsUpdates.featureUpdateCatalogEntry",
            "#microsoft.graph.windowsUpdates.operationalInsightsConnection": "#/components/schemas/microsoft.graph.windowsUpdates.operationalInsightsConnection",
            "#microsoft.graph.windowsUpdates.qualityUpdateCatalogEntry": "#/components/schemas/microsoft.graph.windowsUpdates.qualityUpdateCatalogEntry",
            "#microsoft.graph.windowsUpdates.resourceConnection": "#/components/schemas/microsoft.graph.windowsUpdates.resourceConnection",
            "#microsoft.graph.windowsUpdates.softwareUpdateCatalogEntry": "#/components/schemas/microsoft.graph.windowsUpdates.softwareUpdateCatalogEntry",
            "#microsoft.graph.windowsUpdates.updatableAsset": "#/components/schemas/microsoft.graph.windowsUpdates.updatableAsset",
            "#microsoft.graph.windowsUpdates.updatableAssetGroup": "#/components/schemas/microsoft.graph.windowsUpdates.updatableAssetGroup",
            "#microsoft.graph.windowsUpdates.updatePolicy": "#/components/schemas/microsoft.graph.windowsUpdates.updatePolicy",
            "#microsoft.graph.windowsVpnConfiguration": "#/components/schemas/microsoft.graph.windowsVpnConfiguration",
            "#microsoft.graph.windowsWebApp": "#/components/schemas/microsoft.graph.windowsWebApp",
            "#microsoft.graph.windowsWifiConfiguration": "#/components/schemas/microsoft.graph.windowsWifiConfiguration",
            "#microsoft.graph.windowsWifiEnterpriseEAPConfiguration": "#/components/schemas/microsoft.graph.windowsWifiEnterpriseEAPConfiguration",
            "#microsoft.graph.windowsWiredNetworkConfiguration": "#/components/schemas/microsoft.graph.windowsWiredNetworkConfiguration",
            "#microsoft.graph.workPosition": "#/components/schemas/microsoft.graph.workPosition",
            "#microsoft.graph.workbook": "#/components/schemas/microsoft.graph.workbook",
            "#microsoft.graph.workbookApplication": "#/components/schemas/microsoft.graph.workbookApplication",
            "#microsoft.graph.workbookChart": "#/components/schemas/microsoft.graph.workbookChart",
            "#microsoft.graph.workbookChartAreaFormat": "#/components/schemas/microsoft.graph.workbookChartAreaFormat",
            "#microsoft.graph.workbookChartAxes": "#/components/schemas/microsoft.graph.workbookChartAxes",
            "#microsoft.graph.workbookChartAxis": "#/components/schemas/microsoft.graph.workbookChartAxis",
            "#microsoft.graph.workbookChartAxisFormat": "#/components/schemas/microsoft.graph.workbookChartAxisFormat",
            "#microsoft.graph.workbookChartAxisTitle": "#/components/schemas/microsoft.graph.workbookChartAxisTitle",
            "#microsoft.graph.workbookChartAxisTitleFormat": "#/components/schemas/microsoft.graph.workbookChartAxisTitleFormat",
            "#microsoft.graph.workbookChartDataLabelFormat": "#/components/schemas/microsoft.graph.workbookChartDataLabelFormat",
            "#microsoft.graph.workbookChartDataLabels": "#/components/schemas/microsoft.graph.workbookChartDataLabels",
            "#microsoft.graph.workbookChartFill": "#/components/schemas/microsoft.graph.workbookChartFill",
            "#microsoft.graph.workbookChartFont": "#/components/schemas/microsoft.graph.workbookChartFont",
            "#microsoft.graph.workbookChartGridlines": "#/components/schemas/microsoft.graph.workbookChartGridlines",
            "#microsoft.graph.workbookChartGridlinesFormat": "#/components/schemas/microsoft.graph.workbookChartGridlinesFormat",
            "#microsoft.graph.workbookChartLegend": "#/components/schemas/microsoft.graph.workbookChartLegend",
            "#microsoft.graph.workbookChartLegendFormat": "#/components/schemas/microsoft.graph.workbookChartLegendFormat",
            "#microsoft.graph.workbookChartLineFormat": "#/components/schemas/microsoft.graph.workbookChartLineFormat",
            "#microsoft.graph.workbookChartPoint": "#/components/schemas/microsoft.graph.workbookChartPoint",
            "#microsoft.graph.workbookChartPointFormat": "#/components/schemas/microsoft.graph.workbookChartPointFormat",
            "#microsoft.graph.workbookChartSeries": "#/components/schemas/microsoft.graph.workbookChartSeries",
            "#microsoft.graph.workbookChartSeriesFormat": "#/components/schemas/microsoft.graph.workbookChartSeriesFormat",
            "#microsoft.graph.workbookChartTitle": "#/components/schemas/microsoft.graph.workbookChartTitle",
            "#microsoft.graph.workbookChartTitleFormat": "#/components/schemas/microsoft.graph.workbookChartTitleFormat",
            "#microsoft.graph.workbookComment": "#/components/schemas/microsoft.graph.workbookComment",
            "#microsoft.graph.workbookCommentReply": "#/components/schemas/microsoft.graph.workbookCommentReply",
            "#microsoft.graph.workbookFilter": "#/components/schemas/microsoft.graph.workbookFilter",
            "#microsoft.graph.workbookFormatProtection": "#/components/schemas/microsoft.graph.workbookFormatProtection",
            "#microsoft.graph.workbookFunctionResult": "#/components/schemas/microsoft.graph.workbookFunctionResult",
            "#microsoft.graph.workbookFunctions": "#/components/schemas/microsoft.graph.workbookFunctions",
            "#microsoft.graph.workbookNamedItem": "#/components/schemas/microsoft.graph.workbookNamedItem",
            "#microsoft.graph.workbookOperation": "#/components/schemas/microsoft.graph.workbookOperation",
            "#microsoft.graph.workbookPivotTable": "#/components/schemas/microsoft.graph.workbookPivotTable",
            "#microsoft.graph.workbookRange": "#/components/schemas/microsoft.graph.workbookRange",
            "#microsoft.graph.workbookRangeBorder": "#/components/schemas/microsoft.graph.workbookRangeBorder",
            "#microsoft.graph.workbookRangeFill": "#/components/schemas/microsoft.graph.workbookRangeFill",
            "#microsoft.graph.workbookRangeFont": "#/components/schemas/microsoft.graph.workbookRangeFont",
            "#microsoft.graph.workbookRangeFormat": "#/components/schemas/microsoft.graph.workbookRangeFormat",
            "#microsoft.graph.workbookRangeSort": "#/components/schemas/microsoft.graph.workbookRangeSort",
            "#microsoft.graph.workbookRangeView": "#/components/schemas/microsoft.graph.workbookRangeView",
            "#microsoft.graph.workbookTable": "#/components/schemas/microsoft.graph.workbookTable",
            "#microsoft.graph.workbookTableColumn": "#/components/schemas/microsoft.graph.workbookTableColumn",
            "#microsoft.graph.workbookTableRow": "#/components/schemas/microsoft.graph.workbookTableRow",
            "#microsoft.graph.workbookTableSort": "#/components/schemas/microsoft.graph.workbookTableSort",
            "#microsoft.graph.workbookWorksheet": "#/components/schemas/microsoft.graph.workbookWorksheet",
            "#microsoft.graph.workbookWorksheetProtection": "#/components/schemas/microsoft.graph.workbookWorksheetProtection",
            "#microsoft.graph.workforceIntegration": "#/components/schemas/microsoft.graph.workforceIntegration",
            "#microsoft.graph.workspace": "#/components/schemas/microsoft.graph.workspace",
            "#microsoft.graph.x509CertificateAuthenticationMethodConfiguration": "#/components/schemas/microsoft.graph.x509CertificateAuthenticationMethodConfiguration",
            "#microsoft.graph.zebraFotaArtifact": "#/components/schemas/microsoft.graph.zebraFotaArtifact",
            "#microsoft.graph.zebraFotaConnector": "#/components/schemas/microsoft.graph.zebraFotaConnector",
            "#microsoft.graph.zebraFotaDeployment": "#/components/schemas/microsoft.graph.zebraFotaDeployment"
          },
          "propertyName": "@odata.type"
        },
        "properties": {
          "@odata.type": {
            "type": "string"
          },
          "id": {
            "description": "The unique identifier for an entity. Read-only.",
            "type": "string"
          }
        },
        "required": [
          "@odata.type"
        ],
        "title": "entity",
        "type": "object"
      },
      "microsoft.graph.cloudPcManagementAssignmentTarget": {
        "discriminator": {
          "mapping": {
            "#microsoft.graph.cloudPcManagementGroupAssignmentTarget": "#/components/schemas/microsoft.graph.cloudPcManagementGroupAssignmentTarget"
          },
          "propertyName": "@odata.type"
        },
        "properties": {
          "@odata.type": {
            "type": "string"
          }
        },
        "required": [
          "@odata.type"
        ],
        "title": "cloudPcManagementAssignmentTarget",
        "type": "object"
      }
    }
  },
  "handler": "http",
  "request": {
    "method": "POST",
    "url": {
      "$uri": "https://graph.microsoft.com/beta/deviceManagement/virtualEndpoint/provisioningPolicies/{cloudPcProvisioningPolicy-id}/microsoft.graph.assign"
    },
    "body": {
      "$": "body",
      "encode": "json"
    }
  },
  "responses": {
    "4XX": {
      "$encode": "markdown",
      "$block": [
        {
          "$h1": "Object"
        },
        "**Key properties:**",
        {
          "$ul": [
            [
              "**error**",
              {
                "$ul": [
                  "**code**",
                  "**details**",
                  [
                    "**innererror**",
                    {
                      "$ul": [
                        "**@odata.type**",
                        "**Date**: Date when the error occured.",
                        "**client-request-id**: Client request Id as sent by the client application.",
                        "**request-id**: Request Id as tracked internally by the service"
                      ]
                    }
                  ],
                  "**message**",
                  "**target**"
                ]
              }
            ]
          ]
        },
        {
          "$lang": "json",
          "$code": {
            "$encode": "json",
            "$indent": true,
            "$content": {
              "$": "$.body"
            }
          }
        }
      ]
    },
    "5XX": {
      "$encode": "markdown",
      "$block": [
        {
          "$h1": "Object"
        },
        "**Key properties:**",
        {
          "$ul": [
            [
              "**error**",
              {
                "$ul": [
                  "**code**",
                  "**details**",
                  [
                    "**innererror**",
                    {
                      "$ul": [
                        "**@odata.type**",
                        "**Date**: Date when the error occured.",
                        "**client-request-id**: Client request Id as sent by the client application.",
                        "**request-id**: Request Id as tracked internally by the service"
                      ]
                    }
                  ],
                  "**message**",
                  "**target**"
                ]
              }
            ]
          ]
        },
        {
          "$lang": "json",
          "$code": {
            "$encode": "json",
            "$indent": true,
            "$content": {
              "$": "$.body"
            }
          }
        }
      ]
    }
  }
}
